
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//РемСвинки
	ДниПослеВводаРемСвинки = Константы.ДниПослеВводаРемСвинки.Получить();
	//Свиноматки
	ДниПослеОхотыБезСлучкиСвиноматки = Константы.ДниПослеОхотыБезСлучкиСвиноматки.Получить();
	ПериодСупоросностиСвиноматки = Константы.ПериодСупоросностиСвиноматки.Получить();
	ДнейБезУЗИСвиноматки = Константы.ДнейБезУЗИСвиноматки.Получить();
	ДнейПослеНегативногоУЗИСвиноматки = Константы.ДнейПослеНегативногоУЗИСвиноматки.Получить();
	ДнейПослеАбортаБезПодсосныхСвиноматки = Константы.ДнейПослеАбортаБезПодсосныхСвиноматки.Получить();
	ПодсосныйПериодСвиноматки = Константы.ПодсосныйПериодСвиноматки.Получить();
	ДниПослеОтъемаСвиноматки = Константы.ДниПослеОтъемаСвиноматки.Получить();
	ДниПослеКормленияСвиноматки = Константы._ДниПослеКормленияСвиноматки.Получить();    
	Если Константы.РасчетПустыхДнейДоУбоя.Получить() Тогда
		ПустыеДниДоУбоя 	= Истина;
		ПустыеДниФактически = Ложь; 
	Иначе
		ПустыеДниДоУбоя 	= Ложь;
		ПустыеДниФактически = Истина; 
	КонецЕсли;                                   
	МаксимальноеКоличествоЖиворожденных = Константы.МаксимальноеКоличествоЖиворожденных.Получить();  
	НачалоОтсчетаДняНедели	= Константы.НачалоОтсчетаНомераНедели.Получить();  
	ОтключитьКонтрольОшибок = Константы.ОтключитьКонтрольОшибок.Получить();      
	НомерФермыDG         	= Константы.НомерФермыDG.Получить();
	СерийныйНомерСвинкиОт   = Константы.СерийныйНомерСвинкиОт.Получить();  
	УшнойВыщипИзНомераСвиноматки = Константы.УшнойВыщипИзНомераСвиноматки.Получить();
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНаСервере() 
	Константы.ДниПослеВводаРемСвинки.Установить(ДниПослеВводаРемСвинки);
   	//Свиноматки 
	Константы.ДниПослеОхотыБезСлучкиСвиноматки.Установить(ДниПослеОхотыБезСлучкиСвиноматки);
	Константы.ПериодСупоросностиСвиноматки.Установить(ПериодСупоросностиСвиноматки); 
	Константы.ДнейБезУЗИСвиноматки.Установить(ДнейБезУЗИСвиноматки);
	Константы.ДнейПослеНегативногоУЗИСвиноматки.Установить(ДнейПослеНегативногоУЗИСвиноматки);
	Константы.ДнейПослеАбортаБезПодсосныхСвиноматки.Установить(ДнейПослеАбортаБезПодсосныхСвиноматки); 
	Константы.ПодсосныйПериодСвиноматки.Установить(ПодсосныйПериодСвиноматки);
	Константы.ДниПослеОтъемаСвиноматки.Установить(ДниПослеОтъемаСвиноматки);
	Константы._ДниПослеКормленияСвиноматки.Установить(ДниПослеКормленияСвиноматки); 
	Константы.МаксимальноеКоличествоЖиворожденных.Установить(МаксимальноеКоличествоЖиворожденных); 
	Константы.НачалоОтсчетаНомераНедели.Установить(НачалоОтсчетаДняНедели);  
	Константы.ОтключитьКонтрольОшибок.Установить(ОтключитьКонтрольОшибок);    
	Константы.НомерФермыDG.Установить(НомерФермыDG);
	Константы.СерийныйНомерСвинкиОт.Установить(СерийныйНомерСвинкиОт);  
	Константы.УшнойВыщипИзНомераСвиноматки.Установить(УшнойВыщипИзНомераСвиноматки);

КонецПроцедуры

&НаКлиенте
Процедура Записать(Команда)
	ЗаписатьНаСервере();
КонецПроцедуры


&НаКлиенте
Процедура ПустыеДниДоУбояПриИзменении(Элемент)
	ПустыеДниФактически = Не ПустыеДниДоУбоя;  
	УстановитьКонстантуРасчетПустыхДнейДоУбоя(ПустыеДниДоУбоя);

КонецПроцедуры

&НаСервере
Процедура УстановитьКонстантуРасчетПустыхДнейДоУбоя(Значение)
	
	Константы.РасчетПустыхДнейДоУбоя.Установить(Значение);

КонецПроцедуры


&НаКлиенте
Процедура ПустыеДниФактическиПриИзменении(Элемент)
	ПустыеДниДоУбоя = НЕ ПустыеДниФактически;  
	УстановитьКонстантуРасчетПустыхДнейДоУбоя(ПустыеДниДоУбоя);
КонецПроцедуры


&НаКлиенте
Процедура МаксимальноеКоличествоЖиворожденныхПриИзменении(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры


&НаКлиенте
Процедура НачалоОтсчетаДняНеделиПриИзменении(Элемент)
	УстановитьНачалоОтсчетаДняНеделиНаСервере();

КонецПроцедуры

&НаСервере
Процедура УстановитьНачалоОтсчетаДняНеделиНаСервере()
	
	Константы.НачалоОтсчетаНомераНедели.Установить(НачалоОтсчетаДняНедели);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтключитьКонтрольОшибокПриИзменении(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры


