Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	КормаСтрокой = _НастройкиКонфигурацииНаСервере.ПолучитьСписокТЧСтрокой(ТЧКорма, "Корм");
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ДвижениеКормов Расход
	Движения.ДвижениеКормов.Записывать = Истина;
	Для Каждого ТекСтрокаТЧКорма Из ТЧКорма Цикл
		Движение = Движения.ДвижениеКормов.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Корм = ТекСтрокаТЧКорма.Корм;
		Движение.Количество = ТекСтрокаТЧКорма.Количество;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры