&НаКлиенте
Процедура ТЧОпоросНомерЖивотногоОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Запись = Элементы.ТЧОпорос.ТекущиеДанные;
	Запись.ДатаСобытия = ТекущаяДата();
	СтандартнаяОбработка = Ложь;
	ДанныеПоСвиноматкам = _НастройкиКонфигурацииНаСервере.ПолучитьСписокСвиноматок(ВыбранноеЗначение);
	Если ДанныеПоСвиноматкам.Количество() <> 0 Тогда
		ВыбСтрокаМеню = ВыбратьИзМеню(ДанныеПоСвиноматкам);
		Если ВыбСтрокаМеню <> Неопределено Тогда
			Реквизиты = ВыбСтрокаМеню.Значение;
			Запись.НомерЖивотного = Реквизиты.НомерЖивотного;
			Запись.ДатаВвода	  = Реквизиты.ДатаВвода;
			Запись.КодПороды	  = Реквизиты.КодПороды;
		КонецЕсли;
	Иначе
		Предупреждение("Свиноматки с таким номер нет");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ТЧОпоросМассаВсегоПриИзменении(Элемент)
	Запись = Элементы.ТЧОпорос.ТекущиеДанные;
	Запись.СреднийВес = Запись.МассаВсего / Запись.Живорожденные;
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьОсеменения(Команда)
	Для Каждого Запись Из ТЧДанные Цикл
		СоздатьЗаписьЖурналаОсемененияНаСервере(Запись.ДатаСобытия, Запись.НомерЖивотного, Запись.ДатаВвода,
			Запись.Хряк, Запись.ОценкаСлучки, Запись.Статус, Запись.КодПородыХряк, Запись.Работник);
		_ОбработкаОповещенияНаКлиенте.ОткрытьФормуСвиноматки(Запись.НомерЖивотного, Запись.ДатаВвода);
	КонецЦикла;
	Закрыть();
КонецПроцедуры

&НаСервере
Процедура СоздатьЗаписьЖурналаОсемененияНаСервере(Знач ДатаСлучка, Знач НомерЖивотного, Знач ДатаВвода,
	Знач НомерЖивотногоХряк, Знач ОценкаСлучки, Знач Статус, Знач КодПороды, Знач Работник)

	Перем Записи;

	Записи = РегистрыСведений.ЖурналОсеменения.СоздатьМенеджерЗаписи();
	Записи.Период 				= ДатаСлучка;
	Записи.НомерЖивотного 		= НомерЖивотного;
	Записи.ДатаВвода			= ДатаВвода;
	Записи.НомерЖивотногоХряк 	= НомерЖивотногоХряк;
	Записи.КодПородыХряк		= КодПороды;
	Записи.ОценкаСлучки 		= ОценкаСлучки;
	Записи.Статус 				= Статус;
	Записи.Работник				= Работник;
	Записи.Записать();

КонецПроцедуры

&НаКлиенте
Процедура ТЧОпоросХрякПриИзменении(Элемент)
	Запись = Элементы.ТЧОпорос.ТекущиеДанные;
	Запись.КодПородыХряк = НомерЖивотногоХрякПриИзмененииНаСервере(Запись.Хряк);
КонецПроцедуры

&НаСервере
Функция НомерЖивотногоХрякПриИзмененииНаСервере(Хряк)
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КарточкаВнесенияДанныхСрезПоследних.КодПороды КАК КодПороды
	|ИЗ
	|	РегистрСведений.КарточкаВнесенияДанных.СрезПоследних(, ) КАК КарточкаВнесенияДанныхСрезПоследних
	|ГДЕ
	|	КарточкаВнесенияДанныхСрезПоследних.НомерЖивотного = &НомерЖивотного";

	Запрос.УстановитьПараметр("НомерЖивотного", Хряк);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.КодПороды;
	КонецЦикла;
КонецФункции