&НаСервере
Процедура НомерЖивотногоПриИзмененииНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КарточкаВнесенияДанныхСрезПоследних.КодПороды КАК КодПороды
	|ИЗ
	|	РегистрСведений.КарточкаВнесенияДанных.СрезПоследних КАК КарточкаВнесенияДанныхСрезПоследних
	|ГДЕ
	|	КарточкаВнесенияДанныхСрезПоследних.НомерЖивотного = &НомерЖивотного";

	Запрос.УстановитьПараметр("НомерЖивотного", Запись.НомерЖивотного);

	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Запись.КодПороды = ВыборкаДетальныеЗаписи.КодПороды;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура НомерЖивотногоПриИзменении(Элемент)
	НомерЖивотногоПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
		//ЖурналОпороса
	//	НаборЗаписей = РегистрыСведений.ЖурналОпороса.СоздатьНаборЗаписей(); 
	//    НаборЗаписей.Отбор.НомерЖивотного.Установить(Запись.НомерЖивотного); 
	//	НаборЗаписей.Отбор.НомерОпороса.Установить(Запись.НомерОпороса);
	//	НаборЗаписей.Прочитать(); 

	//	Запрос = Новый Запрос;
	//	Запрос.Текст = 
	//		"ВЫБРАТЬ
	//		|	ЖурналОпоросаСрезПоследних.Период КАК Период
	//		|ИЗ
	//		|	РегистрСведений.ЖурналОпороса.СрезПоследних КАК ЖурналОпоросаСрезПоследних
	//		|ГДЕ
	//		|	ЖурналОпоросаСрезПоследних.НомерЖивотного = &НомерЖивотного
	//		|	И ЖурналОпоросаСрезПоследних.НомерОпороса = &НомерОпороса";
	//	
	//	Запрос.УстановитьПараметр("НомерЖивотного", Запись.НомерЖивотного);
	//	Запрос.УстановитьПараметр("НомерОпороса", Запись.НомерОпороса);
	//	РезультатЗапроса = Запрос.Выполнить();		
	//	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	//	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
	//		Для Каждого Записи Из НаборЗаписей Цикл
	//			Записи.НомерОпороса = Запись.НомерОпороса;
	//			Записи.НомерЖивотного = Запись.НомерЖивотного;
	//			ДатаОпоросаСвиноматки = Константы.ПериодСупоросностиСвиноматки.Получить();
	//        	Записи.Период = Запись.Период + ДатаОпоросаСвиноматки * 60 * 60 * 24;
	//		КонецЦикла;
	//		НаборЗаписей.Записать();
	//	Иначе  		
	//        НоваяЗапись = НаборЗаписей.Добавить();  
	//		НоваяЗапись.НомерОпороса = Запись.НомерОпороса;
	//        НоваяЗапись.НомерЖивотного = Запись.НомерЖивотного;
	//		ДатаОпоросаСвиноматки = Константы.ПериодСупоросностиСвиноматки.Получить();
	//        НоваяЗапись.Период = Запись.Период + ДатаОпоросаСвиноматки * 60 * 60 * 24;
	//        НаборЗаписей.Записать();
	//	КонецЕсли;
	//	//Супоросность
	//	НаборЗаписей = РегистрыСведений.Супоросность.СоздатьНаборЗаписей(); 
	//    НаборЗаписей.Отбор.НомерЖивотного.Установить(Запись.НомерЖивотного);
	//	НаборЗаписей.Отбор.НомерОпороса.Установить(Запись.НомерОпороса);
	//	НаборЗаписей.Прочитать();
	//
	//	Запрос = Новый Запрос;
	//	Запрос.Текст = 
	//		"ВЫБРАТЬ
	//		|	СупоросностьСрезПоследних.Период КАК Период
	//		|ИЗ
	//		|	РегистрСведений.Супоросность.СрезПоследних КАК СупоросностьСрезПоследних
	//		|ГДЕ
	//		|	СупоросностьСрезПоследних.НомерЖивотного = &НомерЖивотного
	//		|	И СупоросностьСрезПоследних.НомерОпороса = &НомерОпороса";
	//	
	//	Запрос.УстановитьПараметр("НомерЖивотного", Запись.НомерЖивотного);
	//	Запрос.УстановитьПараметр("НомерОпороса", Запись.НомерОпороса);		
	//	РезультатЗапроса = Запрос.Выполнить();		
	//	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();		
	//	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
	//		Для Каждого Записи Из НаборЗаписей Цикл
	//			Записи.НомерОпороса = Запись.НомерОпороса;
	//			Записи.НомерЖивотного = Запись.НомерЖивотного;
	//			ДатаУЗИ = Константы.ДнейБезУЗИСвиноматки.Получить(); 
	//        	Записи.Период = Запись.Период + ДатаУЗИ * 60 * 60 * 24;
	//		КонецЦикла;
	//		НаборЗаписей.Записать();
	//	Иначе  			
	//        НоваяЗапись = НаборЗаписей.Добавить(); 
	//		НоваяЗапись.НомерОпороса = Запись.НомерОпороса;
	//        НоваяЗапись.НомерЖивотного = Запись.НомерЖивотного; 
	//		ДатаУЗИ = Константы.ДнейБезУЗИСвиноматки.Получить(); 
	//        НоваяЗапись.Период = Запись.Период + ДатаУЗИ * 60 * 60 * 24;
	//        НаборЗаписей.Записать(); 
	//	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ПараметрыЗаписи)
	Если Параметры.Свойство("НомерЖивотного") Тогда
		Запись.НомерЖивотного 	= Параметры.НомерЖивотного;
		Запись.НомерОпороса 	= Параметры.НомерОпороса;
		Запись.ДатаВвода		= Параметры.ДатаВвода;
		Запись.КодПороды 		= Параметры.Порода;
	КонецЕсли;
	Если Параметры.Свойство("ФормаОткрыта") Тогда
		Открытие = Истина;
	Иначе
		Открытие = Ложь;
	КонецЕсли;
	Запись.Период = НачалоДня(Запись.Период);
КонецПроцедуры

&НаСервере
Процедура НомерЖивотногоХрякПриИзмененииНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КарточкаВнесенияДанныхСрезПоследних.КодПороды КАК КодПороды
	|ИЗ
	|	РегистрСведений.КарточкаВнесенияДанных.СрезПоследних(, ) КАК КарточкаВнесенияДанныхСрезПоследних
	|ГДЕ
	|	КарточкаВнесенияДанныхСрезПоследних.НомерЖивотного = &НомерЖивотного";

	Запрос.УстановитьПараметр("НомерЖивотного", Запись.НомерЖивотногоХряк);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Запись.КодПородыХряк = ВыборкаДетальныеЗаписи.КодПороды;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура НомерЖивотногоХрякПриИзменении(Элемент)
	НомерЖивотногоХрякПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура НомерЖивотногоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

КонецПроцедуры
&НаКлиенте
Процедура НомерЖивотногоОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ДанныеПоСвиноматкам = _НастройкиКонфигурацииНаСервере.ПолучитьСписокСвиноматок(ВыбранноеЗначение);
	Если ДанныеПоСвиноматкам.Количество() <> 0 Тогда
		Если ДанныеПоСвиноматкам.Количество() = 1 Тогда
			Запись.НомерЖивотного = ДанныеПоСвиноматкам[0].Значение.НомерЖивотного;
			Запись.ДатаВвода	  = ДанныеПоСвиноматкам[0].Значение.ДатаВвода;
			Запись.КодПороды	  = ДанныеПоСвиноматкам[0].Значение.КодПороды;
		Иначе
			ВыбСтрокаМеню = ВыбратьИзМеню(ДанныеПоСвиноматкам);
			Если ВыбСтрокаМеню <> Неопределено Тогда
				Реквизиты = ВыбСтрокаМеню.Значение;
				Запись.НомерЖивотного = Реквизиты.НомерЖивотного;
				Запись.ДатаВвода	  = Реквизиты.ДатаВвода;
				Запись.КодПороды	  = Реквизиты.КодПороды;
			КонецЕсли;
		КонецЕсли;
	Иначе
		Предупреждение("Свиноматки с таким номер нет");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	//_ОбработкаОповещенияНаКлиенте.ОткрытьФормуСвиноматки(Запись.НомерЖивотного, Запись.ДатаВвода);
КонецПроцедуры

&НаКлиенте
Процедура ДатаОсемененияПриИзменении(Элемент)
	Запись.Период = НачалоДня(Запись.Период);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если Открытие = Истина Тогда
		Записать();
		_ОбработкаОповещенияНаКлиенте.ОткрытьФормуСвиноматки(Запись.НомерЖивотного, Запись.ДатаВвода);
		Закрыть();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	_ОбработкаОповещенияНаКлиенте.ОткрытьФормуСвиноматки(Запись.НомерЖивотного, Запись.ДатаВвода);
КонецПроцедуры

&НаКлиенте
Процедура НомерЖивотногоХряк1ПриИзменении(Элемент)
	НомерЖивотногоХряк1ПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура НомерЖивотногоХряк1ПриИзмененииНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КарточкаВнесенияДанныхСрезПоследних.КодПороды КАК КодПороды
	|ИЗ
	|	РегистрСведений.КарточкаВнесенияДанных.СрезПоследних(, ) КАК КарточкаВнесенияДанныхСрезПоследних
	|ГДЕ
	|	КарточкаВнесенияДанныхСрезПоследних.НомерЖивотного = &НомерЖивотного";

	Запрос.УстановитьПараметр("НомерЖивотного", Запись.НомерЖивотногоХряк);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Запись.КодПородыХряк1 = ВыборкаДетальныеЗаписи.КодПороды;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура НомерЖивотногоХряк2ПриИзменении(Элемент)
	НомерЖивотногоХряк2ПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура НомерЖивотногоХряк2ПриИзмененииНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КарточкаВнесенияДанныхСрезПоследних.КодПороды КАК КодПороды
	|ИЗ
	|	РегистрСведений.КарточкаВнесенияДанных.СрезПоследних(, ) КАК КарточкаВнесенияДанныхСрезПоследних
	|ГДЕ
	|	КарточкаВнесенияДанныхСрезПоследних.НомерЖивотного = &НомерЖивотного";

	Запрос.УстановитьПараметр("НомерЖивотного", Запись.НомерЖивотногоХряк);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Запись.КодПородыХряк2 = ВыборкаДетальныеЗаписи.КодПороды;
	КонецЦикла;
КонецПроцедуры

//&НаСервере
//Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
//	//Отбор = Новый Структура("НомерЖивотного",Запись.НомерЖивотного);
//	НаборЗаписей = РегистрыСведений.КарточкаСвиноматки.СоздатьНаборЗаписей();
//	НаборЗаписей.Отбор.НомерЖивотного.Установить(Запись.НомерЖивотного);
//	НаборЗаписей.Прочитать();
//	Если НаборЗаписей.Количество() = 0 Тогда
//		НоваяСтрока = РегистрыСведений.КарточкаСвиноматки.СоздатьМенеджерЗаписи();
//		НоваяСтрока.Период = ТекущаяДата();
//		НоваяСтрока.НомерЖивотного = Запись.НомерЖивотного;
//		НоваяСтрока.ДатаОсеменения = Запись.ДатаОсеменения;
//		//НоваяСтрока.КодПороды = Запись.КодПороды;
//		//НоваяСтрока.ДатаВыбытие = Запись.ДатаВыбытие;
//		//НоваяСтрока.ПричинаВыбытия = Запись.НазваниеПричины;
//		//НоваяСтрока.ДатаАборта = Запись.ДатаАбортаОпороса;
//		//НоваяСтрока.ДатаОтъема = Запись.ДатаОтъема;
//		НоваяСтрока.НомерЖивотногоХряк = Запись.НомерЖивотногоХряк;
//		НоваяСтрока.КодРаботника = Запись.Работник;
//		НоваяСтрока.Записать();
//	Иначе	
//		Для Каждого СтрНаборЗаписей из НаборЗаписей Цикл
//			СтрНаборЗаписей.НомерЖивотного = Запись.НомерЖивотного;
//			СтрНаборЗаписей.ДатаСлучка = Запись.Период;
//			//СтрНаборЗаписей.КодПороды = Запись.КодПороды;
//			//СтрНаборЗаписей.ДатаВыбытие = Запись.ДатаВыбытие;
//			//СтрНаборЗаписей.ПричинаВыбытия = Запись.НазваниеПричины;
//			//СтрНаборЗаписей.ДатаАборта = Запись.ДатаАбортаОпороса;
//			//СтрНаборЗаписей.ДатаОтъема = Запись.ДатаОтъема; 
//			СтрНаборЗаписей.КодРаботника = Запись.Работник;
//			СтрНаборЗаписей.НомерЖивотногоХряк = Запись.НомерЖивотногоХряк;
//			СтрНаборЗаписей.КодПородыХряк = Запись.КодПородыХряк;
//		КонецЦикла;
//		НаборЗаписей.Записать();
//	КонецЕсли;
//КонецПроцедуры