Процедура ПриЗаписи(Отказ, Замещение)
	Для Каждого Запись Из ЭтотОбъект Цикл
		Если Запись.РезультатУЗИ = Перечисления.РезультатУЗИ.Негативный Тогда
			НаборЗаписей = РегистрыСведений.ПоследнееСобытие.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.ДатаВвода.Установить(Запись.ДатаВвода);
			НаборЗаписей.Отбор.НомерЖивотного.Установить(Запись.НомерЖивотного);
			НаборЗаписей.Прочитать();
			Если НаборЗаписей.Количество() = 0 Тогда
				ЗаписьСтатус = РегистрыСведений.ПоследнееСобытие.СоздатьМенеджерЗаписи();
				ЗаписьСтатус.ДатаВвода 		= Запись.ДатаВвода;
				ЗаписьСтатус.НомерЖивотного = Запись.НомерЖивотного;
				ЗаписьСтатус.ДатаПоследнегоСобытия =  Запись.Период;
				ЗаписьСтатус.ПоследнееСобытие = Перечисления.ПоследнееСобытие.УЗИ;
				ЗаписьСтатус.НомерОпороса     = Запись.НомерОпороса;
				ЗаписьСтатус.Записать(Истина);
			Иначе
				Для Каждого ЗаписьСтатус Из НаборЗаписей Цикл
					Если (Запись.НомерОпороса >= ЗаписьСтатус.НомерОпороса) И (Запись.Период
						> ЗаписьСтатус.ДатаПоследнегоСобытия) Тогда
						ЗаписьСтатус.ДатаВвода 		= Запись.ДатаВвода;
						ЗаписьСтатус.НомерЖивотного = Запись.НомерЖивотного;
						ЗаписьСтатус.ДатаПоследнегоСобытия =  Запись.Период;
						ЗаписьСтатус.ПоследнееСобытие = Перечисления.ПоследнееСобытие.УЗИ;
						ЗаписьСтатус.НомерОпороса     = Запись.НомерОпороса;
					КонецЕсли;
				КонецЦикла;
				НаборЗаписей.Записать(Истина);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры