&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Отчет.Период.Вариант = ВариантСтандартногоПериода.ЭтаНеделя;
	ПериодПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПериодПриИзмененииНаСервере()
	Отчет.ТЧОтъем.Очистить();
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
				   |	ПоследнееСобытиеРег.НомерОпороса КАК НомерОпороса,
				   |	ПоследнееСобытиеРег.НомерЖивотного КАК НомерЖивотного,
				   |	РАЗНОСТЬДАТ(ПоследнееСобытиеРег.ДатаПоследнегоСобытия, &КонецПериода, ДЕНЬ) КАК Дни,
				   |	ПоследнееСобытиеРег.ДатаПоследнегоСобытия КАК ДатаПоследнегоСобытия
				   |ИЗ
				   |	РегистрСведений.ПоследнееСобытие КАК ПоследнееСобытиеРег
				   |ГДЕ
				   |	ПоследнееСобытиеРег.ПоследнееСобытие = ЗНАЧЕНИЕ(Перечисление.ПоследнееСобытие.Опорос)
				   |
				   |УПОРЯДОЧИТЬ ПО
				   |	Дни";
	Запрос.УстановитьПараметр("КонецПериода", Отчет.Период.ДатаОкончания);
	Отчет.ТЧОтъем.Загрузить(Запрос.Выполнить().Выгрузить());
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	ПериодПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПредварительныйПросмотр(Команда)
	ТабДок = Новый ТабличныйДокумент;
	ПечатьПредварительныйПросмотр(ТабДок);
	ТабДок.ОтображатьСетку 		= Ложь;
	ТабДок.Защита 				= Ложь;
	ТабДок.ТолькоПросмотр 		= Ложь;
	ТабДок.ОтображатьЗаголовки 	= Ложь;
	ТабДок.ОриентацияСтраницы 	= ОриентацияСтраницы.Портрет;
	ТабДок.АвтоМасштаб			= Истина;
	ТабДок.Показать();
КонецПроцедуры
&НаСервере
Процедура ПечатьПредварительныйПросмотр(ТабДок)
	Макет = Отчеты.ЛистОтъема.ПолучитьМакет("ПредварительныйПросмотр");

	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	ОбластьШапка.Параметры.Период = Формат(Отчет.Период.ДатаНачала, "ДФ=dd.MM.yy") + " - " + Формат(
		Отчет.Период.ДатаОкончания, "ДФ=dd.MM.yy");
	ОбластьШапка.Параметры.КоличествоЖивотных = Отчет.ТЧОтъем.Количество();
	ТабДок.Вывести(ОбластьШапка);
	//
	//ЗаписиСписка = ПолучитьТЗИзСписка(); 
	////	ЗаписиСписка.Сортировать("ДатаСлучки");
	Для Каждого СтрЗаписи Из Отчет.ТЧОтъем Цикл
		ЗаполнитьЗначенияСвойств(ОбластьСтрока.Параметры, СтрЗаписи);
		ТабДок.Вывести(ОбластьСтрока);
	КонецЦикла;
КонецПроцедуры