&НаКлиенте
Процедура ТЧОпоросНомерЖивотногоОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Запись = Элементы.ТЧОпорос.ТекущиеДанные;
	Запись.ДатаСобытия = ТекущаяДата();
	СтандартнаяОбработка = Ложь;
	ДанныеПоСвиноматкам = _НастройкиКонфигурацииНаСервере.ПолучитьСписокСвиноматок(ВыбранноеЗначение);
	Если ДанныеПоСвиноматкам.Количество() <> 0 Тогда
		Если ДанныеПоСвиноматкам.Количество() = 1 Тогда
			Запись.НомерЖивотного = ДанныеПоСвиноматкам[0].Значение.НомерЖивотного;
			Запись.ДатаВвода	  = ДанныеПоСвиноматкам[0].Значение.ДатаВвода;
			Запись.КодПороды	  = ДанныеПоСвиноматкам[0].Значение.КодПороды;
			Запись.Возраст		  = (ТекущаяДата() - ДанныеПоСвиноматкам[0].Значение.ДатаРождения) / (24 * 60 * 60);
		Иначе
			ВыбСтрокаМеню = ВыбратьИзМеню(ДанныеПоСвиноматкам);
			Если ВыбСтрокаМеню <> Неопределено Тогда
				Реквизиты = ВыбСтрокаМеню.Значение;
				Запись.НомерЖивотного = Реквизиты.НомерЖивотного;
				Запись.ДатаВвода	  = Реквизиты.ДатаВвода;
				Запись.КодПороды	  = Реквизиты.КодПороды;
				Запись.Возраст		  = (ТекущаяДата() - Реквизиты.ДатаРождения) / (24 * 60 * 60);
			КонецЕсли;
		КонецЕсли;
	Иначе
		Предупреждение("Свиноматки с таким номер нет");
	КонецЕсли;
	ПолучитьДанныеКоличестваОсеменения();
КонецПроцедуры
&НаКлиенте
Процедура ЗаписатьОсеменения(Команда)
	Для Каждого Запись Из ТЧДанные Цикл
		Попытка
			СоздатьЗаписьЖурналаОсемененияНаСервере(Запись.ДатаСобытия, Запись.НомерЖивотного, Запись.КодПороды,
				Запись.ДатаВвода, Запись.Хряк, Запись.ОценкаСлучки, Запись.Статус, Запись.КодПородыХряк,
				Запись.Работник, Запись.Хряк1, Запись.КодПородыХряк1, Запись.Хряк2, Запись.КодПородыХряк2);
			_ОбработкаОповещенияНаКлиенте.ОткрытьФормуСвиноматки(Запись.НомерЖивотного, Запись.ДатаВвода);
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Данные внесены для свиноматки " + Запись.НомерЖивотного;
			Сообщение.Сообщить();
		Исключение
			Ошибка = ОписаниеОшибки();
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст =   "--------------------------------------" + Символы.ПС + "Данные не были внесены"
				+ Символы.ПС + Прав(Ошибка, СтрДлина(Ошибка) - СтрНайти(Ошибка, "}", НаправлениеПоиска.СКонца) - 2)
				+ Символы.ПС + "--------------------------------------";
			Сообщение.Сообщить();
		КонецПопытки;
		//	ТЧДанные.Удалить(Запись);
	КонецЦикла;
	Закрыть();
КонецПроцедуры

&НаСервере
Процедура СоздатьЗаписьЖурналаОсемененияНаСервере(Знач ДатаСлучка, Знач НомерЖивотного, Знач КодПороды, Знач ДатаВвода,
	Знач НомерЖивотногоХряк, Знач ОценкаСлучки, Знач Статус, Знач КодПородыХряк, Знач Работник,
	Знач НомерЖивотногоХряк1, Знач КодПородыХряк1, Знач НомерЖивотногоХряк2, Знач КодПородыХряк2)

	Перем Записи;

	Записи = РегистрыСведений.ЖурналОсеменения.СоздатьМенеджерЗаписи();
	Записи.Период 				= ДатаСлучка;
	Записи.КодПороды			= КодПороды;
	Записи.НомерЖивотного 		= НомерЖивотного;
	Записи.ДатаВвода			= ДатаВвода;
	Записи.ОценкаСлучки 		= ОценкаСлучки;
	Записи.Статус 				= Статус;
	Записи.Работник				= Работник;
	Записи.НомерЖивотногоХряк 	= НомерЖивотногоХряк;
	Записи.КодПородыХряк		= КодПородыХряк;
	Записи.НомерЖивотногоХряк1  = НомерЖивотногоХряк1;
	Записи.КодПородыХряк1       = КодПородыХряк1;
	Записи.НомерЖивотногоХряк2  = НомерЖивотногоХряк2;
	Записи.КодПородыХряк2       = КодПородыХряк2;
	Записи.Записать();

КонецПроцедуры

&НаКлиенте
Процедура ТЧОпоросХрякПриИзменении(Элемент)
	Запись = Элементы.ТЧОпорос.ТекущиеДанные;
	Запись.КодПородыХряк = НомерЖивотногоХрякПриИзмененииНаСервере(Запись.Хряк);
КонецПроцедуры

&НаСервере
Функция НомерЖивотногоХрякПриИзмененииНаСервере(Хряк)
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КарточкаВнесенияДанныхСрезПоследних.КодПороды КАК КодПороды
	|ИЗ
	|	РегистрСведений.КарточкаВнесенияДанных.СрезПоследних(, ) КАК КарточкаВнесенияДанныхСрезПоследних
	|ГДЕ
	|	КарточкаВнесенияДанныхСрезПоследних.НомерЖивотного = &НомерЖивотного";

	Запрос.УстановитьПараметр("НомерЖивотного", Хряк);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.КодПороды;
	КонецЦикла;
КонецФункции

&НаКлиенте
Процедура ТЧОпоросНомерЖивотногоПриИзменении(Элемент)
	ПолучитьДанныеКоличестваОсеменения();

КонецПроцедуры

&НаКлиенте
Процедура ПолучитьДанныеКоличестваОсеменения()

	Перем Запись;

	Запись = Элементы.ТЧОпорос.ТекущиеДанные;
	Элементы.ТЧОпоросНомерЖивотного.ТекстПодвала 		= ТЧДанные.Количество();

КонецПроцедуры

&НаКлиенте
Процедура ТЧОпоросХряк1ПриИзменении(Элемент)
	Запись = Элементы.ТЧОпорос.ТекущиеДанные;
	Запись.КодПородыХряк1 = НомерЖивотногоХрякПриИзмененииНаСервере(Запись.Хряк1);
КонецПроцедуры

&НаКлиенте
Процедура ТЧОпоросХряк2ПриИзменении(Элемент)
	Запись = Элементы.ТЧОпорос.ТекущиеДанные;
	Запись.КодПородыХряк2 = НомерЖивотногоХрякПриИзмененииНаСервере(Запись.Хряк2);

КонецПроцедуры

&НаКлиенте
Процедура ПечатьСписка(Команда)
	ТабДок = Новый ТабличныйДокумент;
	ПечатьСпискаНаСервере(ТабДок);
	ТабДок.АвтоМасштаб = Истина;
	ТабДок.Показать();
КонецПроцедуры

&НаСервере
Процедура ПечатьСпискаНаСервере(ТабДок)

	Перем Колонка, ПострПечать;

	ТаблицаДанные = Новый ТаблицаЗначений;
	ТаблицаДанные = ТЧДанные.Выгрузить();

	ПострПечать = Новый ПостроительОтчета;
	ПострПечать.ИсточникДанных = Новый ОписаниеИсточникаДанных(ТаблицаДанные);
	ПострПечать.Макет = РегистрыСведений.ЖурналОсеменения.ПолучитьМакет("Макет"); 
//	ПострПечать.МакетОформления = ПолучитьМакетОформления(СтандартноеОформление.Интерфейс);
	ПострПечать.Выполнить();
	Для Каждого Колонка Из ПострПечать.ВыбранныеПоля Цикл
		Колонка.Представление = ТаблицаДанные.Колонки[Колонка.Имя].Заголовок;
	КонецЦикла;
	ПострПечать.Вывести(ТабДок);
КонецПроцедуры