
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Отчет.Период.Вариант = ВариантСтандартногоПериода.ЭтаНеделя; 
	ПериодПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПериодПриИзмененииНаСервере()  
	Отчет.ТЧОпорос.Очистить();
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПоследнееСобытиеРег.НомерОпороса КАК НомерОпороса,
	               |	ПоследнееСобытиеРег.НомерЖивотного КАК НомерЖивотного,
	               |	ДОБАВИТЬКДАТЕ(ПоследнееСобытиеРег.ДатаПоследнегоСобытия, ДЕНЬ, &ДнейДоОпороса) КАК ДатаПредпологаемогоОпороса
	               |ИЗ
	               |	РегистрСведений.ПоследнееСобытие КАК ПоследнееСобытиеРег
	               |ГДЕ
	               |	ПоследнееСобытиеРег.ПоследнееСобытие = ЗНАЧЕНИЕ(Перечисление.ПоследнееСобытие.Случка)
	               |	И ДОБАВИТЬКДАТЕ(ПоследнееСобытиеРег.ДатаПоследнегоСобытия, ДЕНЬ, &ДнейДоОпороса) МЕЖДУ &ДатаНач И &ДатаКон
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ДатаПредпологаемогоОпороса";
	Запрос.УстановитьПараметр("ДнейДоОпороса",Константы.ПериодСупоросностиСвиноматки.Получить());
	Запрос.УстановитьПараметр("ДатаНач",Отчет.Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаКон",Отчет.Период.ДатаОкончания);
	Отчет.ТЧОпорос.Загрузить(Запрос.Выполнить().Выгрузить());
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	ПериодПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПредварительныйПросмотр(Команда)
	ТабДок = Новый ТабличныйДокумент;
	ПечатьПредварительныйПросмотр(ТабДок);
	ТабДок.ОтображатьСетку 		= Ложь;
	ТабДок.Защита 				= Ложь;
	ТабДок.ТолькоПросмотр 		= Ложь;
	ТабДок.ОтображатьЗаголовки 	= Ложь;
	ТабДок.ОриентацияСтраницы 	= ОриентацияСтраницы.Портрет;
	ТабДок.АвтоМасштаб			= Истина;
	ТабДок.Показать();
КонецПроцедуры


&НаСервере
Процедура ПечатьПредварительныйПросмотр(ТабДок)
	Макет = Отчеты.ЛистОпороса.ПолучитьМакет("ПредварительныйПросмотр");
	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");	                             	
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка"); 
	ОбластьШапка.Параметры.Период = Формат(Отчет.Период.ДатаНачала,"ДФ=dd.MM.yy")  + " - " + Формат(Отчет.Период.ДатаОкончания,"ДФ=dd.MM.yy"); 
	ОбластьШапка.Параметры.КоличествоЖивотных = Отчет.ТЧОпорос.Количество();
	ТабДок.Вывести(ОбластьШапка);
	//
	//ЗаписиСписка = ПолучитьТЗИзСписка(); 
	////	ЗаписиСписка.Сортировать("ДатаСлучки");
	Для Каждого СтрЗаписи ИЗ Отчет.ТЧОпорос Цикл  
		ЗаполнитьЗначенияСвойств(ОбластьСтрока.Параметры,СтрЗаписи);
		ТабДок.Вывести(ОбластьСтрока);
	КонецЦикла;	  
КонецПроцедуры
