Функция ПолучитьДанныеРодителей(НомерЖивотного, ДатаВвода, Пол) Экспорт
	КарточкаРодителя = Справочники.КарточкаРодители.НайтиПоРеквизиту("НомерЖивотного",НомерЖивотного);
	Если КарточкаРодителя = Справочники.КарточкаРодители.ПустаяСсылка() Тогда
		КарточкаРодителя = Справочники.КарточкаРодители.СоздатьЭлемент();
		КарточкаРодителя.НомерЖивотного = НомерЖивотного;    
		КарточкаРодителя.ДатаВвода = ДатаВвода;   
		Если Пол = Перечисления.пол.Свинка Тогда
			ДанныеРодителей = РегистрыСведений.КарточкаСвиноматки.ПолучитьДанныеРодителей(НомерЖивотного,ДатаВвода);        
		Иначе  
			ДанныеРодителей = РегистрыСведений.КарточкаХряка.ПолучитьДанныеРодителей(НомерЖивотного,ДатаВвода);  
		КонецЕсли;
		Если ДанныеРодителей.Количество() > 0  Тогда   
			КарточкаРодителя.НомерЖивотногоМать = ДанныеРодителей.Мать;
			КарточкаРодителя.НомерЖивотногоОтец = ДанныеРодителей.Отец;  
			КарточкаРодителя.ДатаРождения		= ДанныеРодителей.ДатаРождения;
			КарточкаРодителя.КодПороды			= ДанныеРодителей.КодПороды;  
			КарточкаРодителя.Пол				= Пол;
		КонецЕсли;
		КарточкаРодителя.Записать(); 
		Возврат КарточкаРодителя.Ссылка;
	Иначе
		Возврат КарточкаРодителя;
	КонецЕсли;
	
КонецФункции