Процедура ПередЗаписью(Отказ, Замещение)
	Для Каждого Запись Из ЭтотОбъект Цикл
		Если Запись.Пол = Перечисления.Пол.Хряк Тогда
			НаборЗаписей1 = РегистрыСведений.КарточкаХряка.СоздатьНаборЗаписей();
			НаборЗаписей1.Отбор.НомерЖивотного.Установить(Запись.НомерЖивотного);
			НаборЗаписей1.Отбор.Период.Установить(Запись.Период);
			НаборЗаписей1.Прочитать();
			Если НаборЗаписей1.Количество() = 0 Тогда
				НоваяСтрока1 = РегистрыСведений.КарточкаХряка.СоздатьМенеджерЗаписи();
				НоваяСтрока1.Период 			= Запись.Период;
				НоваяСтрока1.НомерЖивотного 	= Запись.НомерЖивотного;
				НоваяСтрока1.ДатаРождения 		= Запись.ДатаРождения;
				НоваяСтрока1.КодПороды 			= Запись.КодПороды;
				НоваяСтрока1.ДатаВыбытие 		= Запись.ДатаВыбытие;
				//НоваяСтрока1.МассаВыбытие = Запись.МассаВыбытие;
				НоваяСтрока1.НомерЖивотногоОтец = Запись.РодителиОтец;
				НоваяСтрока1.НомерЖивотногоМать = Запись.РодителиМать;
				НоваяСтрока1.DGTagId			= Запись.DGTagId;
				НоваяСтрока1.Записать();
				//НоваяСтрока2 = Документы.КарточкаХрякаДок.СоздатьДокумент();
				//НоваяСтрока2.Дата = ТекущаяДата();
				//НоваяСтрока2.НомерЖивотного = Запись.НомерЖивотного;
				//НоваяСтрока2.ДатаРождения = Запись.ДатаРождения;
				//НоваяСтрока2.КодПороды = Запись.КодПороды;
				//НоваяСтрока2.НазваниеПороды = Запись.НазваниеПороды;
				//НоваяСтрока2.ДатаВыбытие = Запись.ДатаВыбытие;
				//НоваяСтрока2.МассаВыбытие = Запись.МассаВыбытие;
				//НоваяСтрока2.НомерЖивотногоОтец = Запись.НомерЖивотногоОтец;
				//НоваяСтрока2.НомерЖивотногоМать = Запись.НомерЖивотногоМать;
				//НоваяСтрока2.Записать();
			Иначе
				Для Каждого СтрНаборЗаписей Из НаборЗаписей1 Цикл
					СтрНаборЗаписей.Период 			= Запись.Период;
					СтрНаборЗаписей.НомерЖивотного 	= Запись.НомерЖивотного;
					СтрНаборЗаписей.ДатаРождения 	= Запись.ДатаРождения;
					СтрНаборЗаписей.КодПороды 		= Запись.КодПороды;
					//СтрНаборЗаписей.НазваниеПороды = Запись.НазваниеПороды;
					//СтрНаборЗаписей.ДатаВыбытие = Запись.ДатаВыбытие;
					//СтрНаборЗаписей.МассаВыбытие = Запись.МассаВыбытие;
					СтрНаборЗаписей.НомерЖивотногоОтец 	= Запись.РодителиОтец;
					СтрНаборЗаписей.НомерЖивотногоМать 	= Запись.РодителиМать;
					СтрНаборЗаписей.DGTagId				= Запись.DGTagId;
					//СтрНаборЗаписей.МассаВвод = Запись.МассаВвод;
				КонецЦикла;
				НаборЗаписей1.Записать();
			КонецЕсли;
		Иначе
			НаборЗаписей = РегистрыСведений.КарточкаСвиноматки.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.НомерЖивотного.Установить(Запись.НомерЖивотного);
			НаборЗаписей.Отбор.Период.Установить(Запись.Период);
			НаборЗаписей.Прочитать();
			Если НаборЗаписей.Количество() = 0 Тогда
				НоваяСтрока = РегистрыСведений.КарточкаСвиноматки.СоздатьМенеджерЗаписи();
				НоваяСтрока.Период 				= Запись.Период;
				НоваяСтрока.НомерЖивотного 		= Запись.НомерЖивотного;
				НоваяСтрока.ДатаРождения 		= Запись.ДатаРождения;
				НоваяСтрока.КодПороды 			= Запись.КодПороды;
				НоваяСтрока.IDНомер 			= Запись.IDНомер;
				НоваяСтрока.УшнойВыщип 			= Запись.УшнойВыщип;
				НоваяСтрока.МассаВвод 			= Запись.МассаВвод;
				НоваяСтрока.НомерЖивотногоОтец 	= Запись.РодителиОтец;
				НоваяСтрока.НомерЖивотногоМать 	= Запись.РодителиМать;
				НоваяСтрока.ДатаВыбытие         = Запись.ДатаВыбытие;
				НоваяСтрока.ПричинаВыбытия      = Запись.КодВыбытие;
				НоваяСтрока.ТипВыбытие			= Запись.ТипВыбытие;
				НоваяСтрока.МассаВыбытие		= Запись.МассаВыбытие;
				НоваяСтрока.DGTagId				= Запись.DGTagId;
				НоваяСтрока.Записать();
			Иначе
				Если Запись.ДатаВыбытие = '00010101000000' Тогда
					Для Каждого СтрНаборЗаписей Из НаборЗаписей Цикл
						СтрНаборЗаписей.Период 				= Запись.Период;
						СтрНаборЗаписей.НомерЖивотного 		= Запись.НомерЖивотного;
						СтрНаборЗаписей.ДатаРождения 		= Запись.ДатаРождения;
						СтрНаборЗаписей.КодПороды 			= Запись.КодПороды;
						СтрНаборЗаписей.IDНомер 			= Запись.IDНомер;
						СтрНаборЗаписей.УшнойВыщип 			= Запись.УшнойВыщип;
						СтрНаборЗаписей.МассаВвод 			= Запись.МассаВвод;
						СтрНаборЗаписей.НомерЖивотногоОтец 	= Запись.РодителиОтец;
						СтрНаборЗаписей.НомерЖивотногоМать 	= Запись.РодителиМать;
						СтрНаборЗаписей.DGTagId				= Запись.DGTagId;

					КонецЦикла;
					НаборЗаписей.Записать(Истина);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры