&НаКлиенте
Процедура ТЧОпоросНомерЖивотногоОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Запись = Элементы.ТЧОпорос.ТекущиеДанные;
	Запись.ДатаСобытия = ТекущаяДата();
	СтандартнаяОбработка = Ложь;
	ДанныеПоСвиноматкам = _НастройкиКонфигурацииНаСервере.ПолучитьСписокСвиноматок(ВыбранноеЗначение);
	Если ДанныеПоСвиноматкам.Количество() <> 0 Тогда
		Если ДанныеПоСвиноматкам.Количество() = 1 Тогда
			Запись.НомерЖивотного = ДанныеПоСвиноматкам[0].Значение.НомерЖивотного;
			Запись.ДатаВвода	  = ДанныеПоСвиноматкам[0].Значение.ДатаВвода;
			Запись.КодПороды	  = ДанныеПоСвиноматкам[0].Значение.КодПороды;
		Иначе
			ВыбСтрокаМеню = ВыбратьИзМеню(ДанныеПоСвиноматкам);
			Если ВыбСтрокаМеню <> Неопределено Тогда

				Реквизиты = ВыбСтрокаМеню.Значение;
				Запись.НомерЖивотного = Реквизиты.НомерЖивотного;
				Запись.ДатаВвода	  = Реквизиты.ДатаВвода;
				Запись.КодПороды	  = Реквизиты.КодПороды;
			КонецЕсли;
		КонецЕсли;
	Иначе
		Предупреждение("Свиноматки с таким номер нет");
	КонецЕсли;
	ПолучитьДанныеКоличествоОтъем();
КонецПроцедуры

&НаКлиенте
Процедура ТЧОпоросМассаВсегоПриИзменении(Элемент)
	Запись = Элементы.ТЧОпорос.ТекущиеДанные;
	Если Запись.Живорожденные > 0 Тогда
		Запись.СреднийВес = Запись.МассаВсего / Запись.Живорожденные;
	КонецЕсли;
	Элементы.ТЧОпоросКоличествоОтъемышей.ТекстПодвала 	= ТЧДанные.Итог("КоличествоОтъемышей");
	Элементы.ТЧОпоросМассаВсего.ТекстПодвала 			= ТЧДанные.Итог("МассаВсего");
	Элементы.ТЧОпоросСреднийВес.ТекстПодвала 			= ТЧДанные.Итог("СреднийВес");
	Элементы.ТЧОпоросНомерЖивотного.ТекстПодвала 		= ТЧДанные.Количество();
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьОсеменения(Команда)
	Для Каждого Запись Из ТЧДанные Цикл
		Попытка
			СоздатьЗаписьЖурналаОтъемаНаСервере(Запись.ДатаСобытия, Запись.НомерЖивотного, Запись.ДатаВвода,
				Запись.КодМеста, Запись.НомерОпороса, Запись.Мачеха, Запись.КоличествоОтъемышей, Запись.МассаВсего,
				Запись.СреднийВес, Запись.ТолщинаШпика);
			_ОбработкаОповещенияНаКлиенте.ОткрытьФормуСвиноматки(Запись.НомерЖивотного, Запись.ДатаВвода);
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Данные внесены для свиноматки " + Запись.НомерЖивотного;
			Сообщение.Сообщить();
		Исключение
			Ошибка = ОписаниеОшибки();
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст =   "--------------------------------------" + Символы.ПС + "Данные не были внесены"
				+ Символы.ПС + Прав(Ошибка, СтрДлина(Ошибка) - СтрНайти(Ошибка, "}", НаправлениеПоиска.СКонца) - 2)
				+ Символы.ПС + "--------------------------------------";
			Сообщение.Сообщить();
		КонецПопытки;
	КонецЦикла;
	Закрыть();
КонецПроцедуры

&НаСервере
Процедура СоздатьЗаписьЖурналаОтъемаНаСервере(Знач ДатаОтъема, Знач НомерЖивотного, Знач ДатаВвода, Знач Место,
	Знач НомерОпороса, Знач Мачеха, Знач КоличествоОтъемышей, Знач МассаВсего, Знач СреднийВес, Знач ТолщинаШпика)

	Перем Записи;

	Записи = РегистрыСведений.ЖурналОтъема.СоздатьМенеджерЗаписи();
	Записи.Период 				= ДатаОтъема;
	Записи.НомерЖивотного 		= НомерЖивотного;
	Записи.ДатаВвода			= ДатаВвода;
	Записи.КодМеста 			= Место;
	Записи.НомерОпороса			= НомерОпороса;
	Записи.Мачеха 				= Мачеха;
	Записи.КоличествоОтъемышей 	= КоличествоОтъемышей;
	Записи.МассаВсего			= МассаВсего;
	Записи.СреднийВес			= СреднийВес;
	Записи.ТолщинаШпика			= ТолщинаШпика;
	Записи.Записать();

КонецПроцедуры

&НаКлиенте
Процедура ТЧОпоросХрякПриИзменении(Элемент)
	Запись = Элементы.ТЧОпорос.ТекущиеДанные;
	Запись.КодПородыХряк = НомерЖивотногоХрякПриИзмененииНаСервере(Запись.Хряк);
КонецПроцедуры

&НаСервере
Функция НомерЖивотногоХрякПриИзмененииНаСервере(Хряк)
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КарточкаВнесенияДанныхСрезПоследних.КодПороды КАК КодПороды
	|ИЗ
	|	РегистрСведений.КарточкаВнесенияДанных.СрезПоследних(, ) КАК КарточкаВнесенияДанныхСрезПоследних
	|ГДЕ
	|	КарточкаВнесенияДанныхСрезПоследних.НомерЖивотного = &НомерЖивотного";

	Запрос.УстановитьПараметр("НомерЖивотного", Хряк);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.КодПороды;
	КонецЦикла;
КонецФункции

&НаКлиенте
Процедура ТЧОпоросКоличествоОтъемышейПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ТЧОпорос.ТекущиеДанные;
	ТекущиеДанные.СреднийВес = ОКР(ТекущиеДанные.МассаВсего / ТекущиеДанные.КоличествоОтъемышей, 2);
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьДанныеКоличествоОтъем()

	Перем Запись;

	Запись = Элементы.ТЧОпорос.ТекущиеДанные;
	Элементы.ТЧОпоросНомерЖивотного.ТекстПодвала 		= ТЧДанные.Количество();

КонецПроцедуры

&НаСервере
Процедура ПечатьСпискаНаСервере(ТабДок)

	Перем Колонка, ПострПечать;

	ТаблицаДанные = Новый ТаблицаЗначений;
	ТаблицаДанные = ТЧДанные.Выгрузить();

	ПострПечать = Новый ПостроительОтчета;
	ПострПечать.ИсточникДанных = Новый ОписаниеИсточникаДанных(ТаблицаДанные);
	ПострПечать.Макет = РегистрыСведений.ЖурналОтъема.ПолучитьМакет("Макет"); 
//	ПострПечать.МакетОформления = ПолучитьМакетОформления(СтандартноеОформление.Интерфейс);
	ПострПечать.Выполнить();
	Для Каждого Колонка Из ПострПечать.ВыбранныеПоля Цикл
		Колонка.Представление = ТаблицаДанные.Колонки[Колонка.Имя].Заголовок;
	КонецЦикла;
	ПострПечать.Вывести(ТабДок);
КонецПроцедуры

&НаКлиенте
Процедура ПечатьСписка(Команда)
	ТабДок = Новый ТабличныйДокумент;
	ПечатьСпискаНаСервере(ТабДок);
	ТабДок.АвтоМасштаб = Истина;
	ТабДок.Показать();
КонецПроцедуры