
&НаСервере
Процедура НомерЖивотногоПриИзмененииНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КарточкаВнесенияДанныхСрезПоследних.ДатаРождения КАК ДатаРождения,
		|	КарточкаВнесенияДанныхСрезПоследних.КодПороды КАК КодПороды
		|ИЗ
		|	РегистрСведений.КарточкаВнесенияДанных.СрезПоследних КАК КарточкаВнесенияДанныхСрезПоследних
		|ГДЕ
		|	КарточкаВнесенияДанныхСрезПоследних.НомерЖивотного = &НомерЖивотного";
	
	Запрос.УстановитьПараметр("НомерЖивотного", Запись.НомерЖивотного);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Запись.ДатаРождения = ВыборкаДетальныеЗаписи.ДатаРождения;
		Запись.КодПороды = ВыборкаДетальныеЗаписи.КодПороды;
	
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура НомерЖивотногоПриИзменении(Элемент)
	НомерЖивотногоПриИзмененииНаСервере();
КонецПроцедуры


&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	//Отбор = Новый Структура("НомерЖивотного",Запись.НомерЖивотного);
	НаборЗаписей = РегистрыСведений.КарточкаСвиноматки.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.НомерЖивотного.Установить(Запись.НомерЖивотного); 
	НаборЗаписей.Отбор.Период.Установить(Запись.ДатаВвода);
	НаборЗаписей.Прочитать();
	НаборЗаписей1 = РегистрыСведений.КарточкаХряка.СоздатьНаборЗаписей();
	НаборЗаписей1.Отбор.НомерЖивотного.Установить(Запись.НомерЖивотного);
	НаборЗаписей1.Отбор.Период.Установить(Запись.ДатаВвода);
	НаборЗаписей1.Прочитать();
	Если Запись.Пол = Перечисления.Пол.Хряк Тогда
		Если НаборЗаписей1.Количество() = 0 Тогда
			НоваяСтрока = РегистрыСведений.КарточкаХряка.СоздатьМенеджерЗаписи();
			НоваяСтрока.Период = ТекущаяДата();
			НоваяСтрока.НомерЖивотного = Запись.НомерЖивотного;
			НоваяСтрока.ДатаВыбытие = Запись.Период;
			НоваяСтрока.ДатаРождения = Запись.ДатаРождения;
			НоваяСтрока.КодПороды = Запись.КодПороды;
			НоваяСтрока.ТипВыбытие = Запись.ТипВыбытие;
			НоваяСтрока.КодПричины = Запись.КодПричины;
			НоваяСтрока.МассаВыбытие = Запись.МассаВыбытие;
			НоваяСтрока.Записать();
		Иначе	
			Для Каждого СтрНаборЗаписей из НаборЗаписей1 Цикл
				СтрНаборЗаписей.НомерЖивотного = Запись.НомерЖивотного;
				СтрНаборЗаписей.ДатаВыбытие = Запись.Период;
				СтрНаборЗаписей.ДатаРождения = Запись.ДатаРождения;
				СтрНаборЗаписей.КодПороды = Запись.КодПороды;
				СтрНаборЗаписей.ТипВыбытие = Запись.ТипВыбытие;
				СтрНаборЗаписей.КодПричины = Запись.КодПричины;
				СтрНаборЗаписей.МассаВыбытие = Запись.МассаВыбытие;
			КонецЦикла;
			НаборЗаписей1.Записать();
		КонецЕсли;
	Иначе
		Если НаборЗаписей.Количество() = 0 Тогда
			НоваяСтрока = РегистрыСведений.КарточкаСвиноматки.СоздатьМенеджерЗаписи();
			НоваяСтрока.Период = Запись.ДатаВвода;
			НоваяСтрока.НомерЖивотного = Запись.НомерЖивотного;
			НоваяСтрока.ДатаВыбытие = Запись.Период;
			НоваяСтрока.ДатаРождения = Запись.ДатаРождения;
			НоваяСтрока.КодПороды = Запись.КодПороды;
			НоваяСтрока.ТипВыбытие = Запись.ТипВыбытие;
			НоваяСтрока.КодВыбытие = Запись.КодПричины;
			НоваяСтрока.НомерОпороса = Запись.НомерОпороса;
			НоваяСтрока.МассаВыбытие = Запись.МассаВыбытие;
			НоваяСтрока.Записать();
		Иначе	
			Для Каждого СтрНаборЗаписей из НаборЗаписей Цикл
				СтрНаборЗаписей.НомерЖивотного = Запись.НомерЖивотного;
				СтрНаборЗаписей.ДатаВыбытие = Запись.Период;
				СтрНаборЗаписей.ДатаРождения = Запись.ДатаРождения;
				СтрНаборЗаписей.КодПороды = Запись.КодПороды;
				СтрНаборЗаписей.ТипВыбытие = Запись.ТипВыбытие;
				СтрНаборЗаписей.КодВыбытие = Запись.КодПричины;
				СтрНаборЗаписей.НомерОпороса = Запись.НомерОпороса;
				СтрНаборЗаписей.МассаВыбытие = Запись.МассаВыбытие;
			КонецЦикла;
			НаборЗаписей.Записать();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НомерЖивотногоОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ДанныеПоСвиноматкам = _НастройкиКонфигурацииНаСервере.ПолучитьСписокСвиноматок(ВыбранноеЗначение);
	Если ДанныеПоСвиноматкам.Количество() <> 0 Тогда
		ВыбСтрокаМеню = ВыбратьИзМеню(ДанныеПоСвиноматкам); 
		Если ВыбСтрокаМеню <> Неопределено Тогда 
			Реквизиты = ВыбСтрокаМеню.Значение;
			Запись.НомерЖивотного = Реквизиты.НомерЖивотного;
			Запись.ДатаВвода	  = Реквизиты.ДатаВвода;
			Запись.КодПороды	  = Реквизиты.КодПороды;
		КонецЕсли;
	Иначе
		Предупреждение("Свиноматки с таким номер нет");
	КонецЕсли
КонецПроцедуры




