
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("ДатаВвода") И Параметры.Свойство("НомерЖивотного") Тогда
		Запись.ДатаВвода 		= Параметры.ДатаВвода; 
		Запись.НомерЖивотного 	= Параметры.НомерЖивотного;
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура ЖурналЛеченияПриИзмененииНаСервере()
	Запись.Медикаменты 	= Запись.ЖурналЛечения.Медикаменты;
	Запись.Диагноз		= Запись.ЖурналЛечения.Диагноз;
КонецПроцедуры

&НаКлиенте
Процедура ЖурналЛеченияПриИзменении(Элемент)
	ЖурналЛеченияПриИзмененииНаСервере();
КонецПроцедуры
