
&НаСервере
Процедура СформироватьНаСервере(ТабДок)  
	ТабДок.Очистить();
	Макет = Отчеты.ЧисленностьСвиней.ПолучитьМакет("Макет");
    ОбластьШапка = Макет.ПолучитьОбласть("Шапка"); 
	ОбластьШапка.Параметры.Дата = Отчет.Дата;
	ТабДок.Вывести(ОбластьШапка); 
	ОбластьХряки = Макет.ПолучитьОбласть("Хряки");
	ОбластьСвинки = Макет.ПолучитьОбласть("Свинки");
	ОбластьСуп = Макет.ПолучитьОбласть("Суп");
	ОбластьЛакт = Макет.ПолучитьОбласть("Лакт");
	ОбластьПустые = Макет.ПолучитьОбласть("Пустые");
	ОбластьРем = Макет.ПолучитьОбласть("Рем");
	ОбластьПодсосные = Макет.ПолучитьОбласть("Подсосные");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МАКСИМУМ(ЖурналОтъемаСрезПоследних.Период) КАК ДатаОтъема,
		|	МАКСИМУМ(ЖурналОтъемаСрезПоследних.Период) КАК ДатаОпороса,
		|	МАКСИМУМ(ЖурналОсемененияСрезПоследних.Период) КАК ДатаОсеменения,
		|	КарточкаСвиноматкиСрезПоследних.НомерОпороса КАК НомерОпороса,
		|	КарточкаСвиноматкиСрезПоследних.Период КАК ДатаВвода,
		|	КарточкаСвиноматкиСрезПоследних.НомерЖивотного КАК НомерЖивотного,
		|	ЗНАЧЕНИЕ(Перечисление.Пол.Свинка) КАК Пол,
		|	СУММА(ЕСТЬNULL(КарточкаВнесенияДанных.МассаВвод, 0)) КАК МассаВвод,
		|	СУММА(ЕСТЬNULL(ЖурналОпоросаСрезПоследних.ПереведеноПоросят, 0)) КАК ПереведеноПоросят,
		|	СУММА(ЕСТЬNULL(ЖурналОпоросаСрезПоследних.МассаВсего, 0)) КАК МассаВсего
		|ИЗ
		|	РегистрСведений.КарточкаСвиноматки.СрезПоследних КАК КарточкаСвиноматкиСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЖурналОтъема.СрезПоследних КАК ЖурналОтъемаСрезПоследних
		|		ПО КарточкаСвиноматкиСрезПоследних.НомерЖивотного = ЖурналОтъемаСрезПоследних.НомерЖивотного
		|			И КарточкаСвиноматкиСрезПоследних.НомерОпороса = ЖурналОтъемаСрезПоследних.НомерОпороса
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЖурналОсеменения.СрезПоследних КАК ЖурналОсемененияСрезПоследних
		|		ПО КарточкаСвиноматкиСрезПоследних.НомерЖивотного = ЖурналОсемененияСрезПоследних.НомерЖивотного
		|			И КарточкаСвиноматкиСрезПоследних.НомерОпороса = ЖурналОсемененияСрезПоследних.НомерОпороса
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЖурналОпороса.СрезПоследних КАК ЖурналОпоросаСрезПоследних
		|		ПО КарточкаСвиноматкиСрезПоследних.НомерЖивотного = ЖурналОпоросаСрезПоследних.НомерЖивотного
		|			И КарточкаСвиноматкиСрезПоследних.НомерОпороса = ЖурналОпоросаСрезПоследних.НомерОпороса
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КарточкаВнесенияДанных КАК КарточкаВнесенияДанных
		|		ПО КарточкаСвиноматкиСрезПоследних.НомерЖивотного = КарточкаВнесенияДанных.НомерЖивотного
		|			И КарточкаСвиноматкиСрезПоследних.Период = КарточкаВнесенияДанных.Период
		|ГДЕ
		|	КарточкаСвиноматкиСрезПоследних.ДатаВыбытие = ДАТАВРЕМЯ(1, 1, 1)
		|
		|СГРУППИРОВАТЬ ПО
		|	КарточкаСвиноматкиСрезПоследних.НомерОпороса,
		|	КарточкаСвиноматкиСрезПоследних.Период,
		|	КарточкаСвиноматкиСрезПоследних.НомерЖивотного
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	КарточкаХряка.Период,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	КарточкаХряка.НомерЖивотного,
		|	ЗНАЧЕНИЕ(Перечисление.Пол.Хряк),
		|	СУММА(ЕСТЬNULL(КарточкаВнесенияДанных.МассаВвод, 0)),
		|	NULL,
		|	NULL
		|ИЗ
		|	РегистрСведений.КарточкаХряка КАК КарточкаХряка
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КарточкаВнесенияДанных КАК КарточкаВнесенияДанных
		|		ПО КарточкаХряка.НомерЖивотного = КарточкаВнесенияДанных.НомерЖивотного
		|			И КарточкаХряка.Период = КарточкаВнесенияДанных.Период
		|ГДЕ
		|	КарточкаХряка.ДатаВыбытие = ДАТАВРЕМЯ(1, 1, 1)
		|
		|СГРУППИРОВАТЬ ПО
		|	КарточкаХряка.НомерЖивотного,
		|	КарточкаХряка.Период";
		
	РезультатЗапроса = Запрос.Выполнить();	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать(); 
	КолХряки = 0; 
	ВесХряки = 0;
	КолСвинки = 0;
	ВесСвинки = 0;
	КолСуп = 0;
	ВесСуп = 0;
	КолЛакт = 0;
	ВесЛакт = 0;
	КолПустые = 0;
	ВесПустые = 0; 
	КолРем = 0;
	ВесРем = 0;
	КолПодсосные = 0;
	ВесПодсосные = 0;
    НомерЖивотного = "";
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ВыборкаДетальныеЗаписи.НомерЖивотного <> НомерЖивотного Тогда
		//Хряки
		Если ВыборкаДетальныеЗаписи.Пол = Перечисления.Пол.Хряк Тогда  		
            КолХряки = КолХряки + 1;
			ВесХряки = ВесХряки + ВыборкаДетальныеЗаписи.МассаВвод;	
		КонецЕсли; 
		Если ВыборкаДетальныеЗаписи.НомерОпороса = 0 Тогда
            //Рем
			КолРем = КолРем + 1;
			ВесРем = ВесРем + ВыборкаДетальныеЗаписи.МассаВвод;					
		Иначе	
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	РегПоследнееСобытие.ПоследнееСобытие КАК ПоследнееСобытие
				|ИЗ
				|	РегистрСведений.ПоследнееСобытие КАК РегПоследнееСобытие
				|ГДЕ
				|	РегПоследнееСобытие.НомерЖивотного = &НомерЖивотного
				|	И РегПоследнееСобытие.ДатаВвода = &ДатаВвода";	
			Запрос.УстановитьПараметр("НомерЖивотного", ВыборкаДетальныеЗаписи.НомерЖивотного);	 
			Запрос.УстановитьПараметр("ДатаВвода", ВыборкаДетальныеЗаписи.ДатаВвода);	
			РезультатЗапроса = Запрос.Выполнить();	
			Выборка = РезультатЗапроса.Выбрать();	
			Пока Выборка.Следующий() Цикл
				Если Выборка.ПоследнееСобытие = Перечисления.ПоследнееСобытие.Случка  ИЛИ Выборка.ПоследнееСобытие = Перечисления.ПоследнееСобытие.УЗИ Тогда
					//Свинки 
					Если ВыборкаДетальныеЗаписи.НомерОпороса = 1 И НЕ ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ДатаОпороса) Тогда  
						КолСвинки = КолСвинки + 1;
						ВесСвинки = ВесСвинки + ВыборкаДетальныеЗаписи.МассаВвод;	
			  		//Суп
					Иначе
						КолСуп = КолСуп + 1;
						ВесСуп = ВесСуп + ВыборкаДетальныеЗаписи.МассаВвод;
					КонецЕсли;
				//Лакт	
				ИначеЕсли Выборка.ПоследнееСобытие = Перечисления.ПоследнееСобытие.Опорос Тогда	 						
					КолЛакт = КолЛакт + 1;
					ВесЛакт = ВесЛакт + ВыборкаДетальныеЗаписи.МассаВвод; 
				//Пустые
				ИначеЕсли Выборка.ПоследнееСобытие = Перечисления.ПоследнееСобытие.Отъем ИЛИ Выборка.ПоследнееСобытие = Перечисления.ПоследнееСобытие.Аборт Тогда
					КолПустые = КолПустые + 1;
					ВесПустые = ВесПустые + ВыборкаДетальныеЗаписи.МассаВвод;
				КонецЕсли;
			КонецЦикла; 		
		КонецЕсли;
        //Подсосные 
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ПереведеноПоросят) Тогда
		    КолПодсосные = КолПодсосные + ВыборкаДетальныеЗаписи.ПереведеноПоросят;
			   ВесПодсосные = ВесПодсосные + ВыборкаДетальныеЗаписи.МассаВсего; 
		КонецЕсли;
	КонецЕсли;
	НомерЖивотного = ВыборкаДетальныеЗаписи.НомерЖивотного;
	КонецЦикла;  
	//Хряки
	ОбластьХряки.Параметры.Хряки = Перечисления.ТипыСвиней.Хряки;
	ОбластьХряки.Параметры.КолХряки = КолХряки;
	ОбластьХряки.Параметры.ВесХряки = ВесХряки;
	Если КолХряки > 0 Тогда                      
		ОбластьХряки.Параметры.СреднийВесХряки = ВесХряки/КолХряки;
	КонецЕсли;
    ТабДок.Вывести(ОбластьХряки); 
	//Свинки
	ОбластьСвинки.Параметры.Свинки = Перечисления.ТипыСвиней.Свинки;
	ОбластьСвинки.Параметры.КолСвинки = КолСвинки;
	ОбластьСвинки.Параметры.ВесСвинки = ВесСвинки;
	Если КолСвинки > 0 Тогда                      
		ОбластьСвинки.Параметры.СреднийВесСвинки = ВесСвинки/КолСвинки;
	КонецЕсли;
    ТабДок.Вывести(ОбластьСвинки);
	//Суп
    ОбластьСуп.Параметры.Суп = Перечисления.ТипыСвиней.СупоросныеСвиноматки;
	ОбластьСуп.Параметры.КолСуп = КолСуп;
	ОбластьСуп.Параметры.ВесСуп = ВесСуп;
	Если КолСуп > 0 Тогда                      
		ОбластьСуп.Параметры.СреднийВесСуп = ВесСуп/КолСуп;
	КонецЕсли;
    ТабДок.Вывести(ОбластьСуп);
    //Лакт
    ОбластьЛакт.Параметры.Лакт = Перечисления.ТипыСвиней.ЛактирующиеСвиноматки;
	ОбластьЛакт.Параметры.КолЛакт = КолЛакт;
	ОбластьЛакт.Параметры.ВесЛакт = ВесЛакт;
	Если КолЛакт > 0 Тогда                      
		ОбластьЛакт.Параметры.СреднийВесЛакт = ВесЛакт/КолЛакт;
	КонецЕсли;
    ТабДок.Вывести(ОбластьЛакт);
	//Пустые
    ОбластьПустые.Параметры.Пустые = Перечисления.ТипыСвиней.ПустыеСвиноматки;
	ОбластьПустые.Параметры.КолПустые = КолПустые;
	ОбластьПустые.Параметры.ВесПустые = ВесПустые;
	Если КолПустые > 0 Тогда                      
		ОбластьПустые.Параметры.СреднийВесПустые = ВесПустые/КолПустые;
	КонецЕсли;
    ТабДок.Вывести(ОбластьПустые);
	//Рем
    ОбластьРем.Параметры.Рем = Перечисления.ТипыСвиней.РемСвинки;
	ОбластьРем.Параметры.КолРем = КолРем;
	ОбластьРем.Параметры.ВесРем = ВесРем;
	Если КолРем > 0 Тогда                      
		ОбластьРем.Параметры.СреднийВесРем = ВесРем/КолРем;
	КонецЕсли;
    ТабДок.Вывести(ОбластьРем);
	//Подсосные
    ОбластьПодсосные.Параметры.Подсосные = Перечисления.ТипыСвиней.ПодсосныеПоросята;
	ОбластьПодсосные.Параметры.КолПодсосные = КолПодсосные;
	ОбластьПодсосные.Параметры.ВесПодсосные = ВесПодсосные;
	Если КолПодсосные > 0 Тогда                      
		ОбластьПодсосные.Параметры.СреднийВесПодсосные = ВесПодсосные/КолПодсосные;
	КонецЕсли;
    //ТабДок.Вывести(ОбластьПодсосные);
	//Итого
	ИтогоКол = КолХряки + КолСвинки + КолСуп + КолЛакт + КолПустые + КолРем; // + КолПодсосные;
	ИтогоВес = ВесХряки + ВесСвинки + ВесСуп + ВесЛакт + ВесПустые + ВесРем; // + ВесПодсосные;
	ОбластьПодвал.Параметры.ИтогоКол = ИтогоКол;
	ОбластьПодвал.Параметры.ИтогоВес = ИтогоВес;
	Если ИтогоКол > 0 Тогда                      
		ОбластьПодвал.Параметры.ИтогоСреднийВес = ИтогоВес/ИтогоКол;
	КонецЕсли;
    ТабДок.Вывести(ОбластьПодвал);
	
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)                                                                                                    
	ПечатьОтчетаНаКлиенте();

	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьОтчетаНаКлиенте()
	
	СформироватьНаСервере(ТабДок);
	ТабДок.ОтображатьСетку 		= Ложь;
	ТабДок.Защита 				= Ложь;
	ТабДок.ТолькоПросмотр 		= Ложь;
	ТабДок.ОтображатьЗаголовки 	= Ложь;
	ТабДок.ОриентацияСтраницы 	= ОриентацияСтраницы.Портрет;
	ТабДок.АвтоМасштаб			= Истина;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Отчет.Дата = ТекущаяДата();  
	ПечатьОтчетаНаКлиенте();

КонецПроцедуры
