&НаКлиенте
Процедура ПутьСохраненияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Режим = РежимДиалогаВыбораФайла.Открытие;
	ДиалогОткрытия = Новый ДиалогВыбораФайла(Режим);
	Фильтр = НСтр("ru = 'Обновление'; en = 'Update'") + "(*.cf)|*.cf|" + НСтр("ru = 'Обновление'; en = 'Update'")
		+ "(*.cfu)|*.cfu";
	ДиалогОткрытия.Фильтр = Фильтр;
	ДиалогОткрытия.Каталог = "";
	ДиалогОткрытия.МножественныйВыбор = Ложь;
	ДиалогОткрытия.Заголовок = "Выберите каталог";
	ДиалогОткрытия.Показать(Новый ОписаниеОповещения("ВыгрузитьЗавершение", ЭтаФорма, Новый Структура("Диалог",
		ДиалогОткрытия)));
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт

	Диалог = ДополнительныеПараметры.Диалог;

	Если (ВыбранныеФайлы <> Неопределено) Тогда
		Объект.ПутьСохранения = Диалог.ПолноеИмяФайла;
		Объект.КаталогОбновления = Диалог.Каталог;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СделатьКопию(Команда)
	ОтвентНавопрос = Неопределено;

	ПоказатьВопрос(Новый ОписаниеОповещения("СделатьКопиюЗавершение", ЭтотОбъект),
		"Работа программы будет завершена. Все не сохраненные данные могут быть утеряны. Обновить программу?",
		РежимДиалогаВопрос.ДаНет);
КонецПроцедуры

&НаКлиенте
Процедура СделатьКопиюЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт

#Если Не ВебКлиент Тогда
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		СброситьДатуПоследнейКопии();
		Текст = Новый ЗаписьТекста(Объект.КаталогОбновления + "\update.bat", // имя

			КодировкаТекста.ANSI, // кодировка

			Символы.ПС, // разделитель строк (необ.)

			Ложь // перезаписывать файл, а не дописывать в конец (необ.)
		);
		Текст.ЗаписатьСтроку("echo off");
		Текст.ЗаписатьСтроку("cls");
		Текст.ЗаписатьСтроку("chcp 1251");

		Текст.ЗаписатьСтроку("rem -- Убивам процесс 1С если он такой есть");
		Текст.ЗаписатьСтроку("taskkill /f /im 1cv8c.exe");

		Текст.ЗаписатьСтроку("rem -- определяем какая платформа 1С стоит х86 или х64,");
		Текст.ЗаписатьСтроку("rem -- пути у них разные");
		Текст.ЗаписатьСтроку("IF EXIST ""%programfiles%\1cv8\common\1cestart.exe"" (");
		Текст.ЗаписатьСтроку("	set path_1C=""%programfiles%\1cv8\common\1cestart.exe""");
		Текст.ЗаписатьСтроку("	) ELSE (");
		Текст.ЗаписатьСтроку("	set path_1C=""%programfiles(x86)%\1cv8\common\1cestart.exe""");
		Текст.ЗаписатьСтроку("	)");
		Текст.ЗаписатьСтроку("rem -----------------------------------------------");

		Текст.ЗаписатьСтроку("rem -- Данные пользователя");
		Текст.ЗаписатьСтроку("set user_1C=""Пользователь""");
		Текст.ЗаписатьСтроку("set pswd_1C=""""");
		Текст.ЗаписатьСтроку("rem -- Название базы");
		НазваниеФайла = Объект.ПутьСохранения;
		Текст.ЗаписатьСтроку("set cfu_file=" + """" + НазваниеФайла + """");
		Текст.ЗаписатьСтроку("rem -- путь базы бэкапа");
		Текст.ЗаписатьСтроку("set name_base_backup=" + ПолучитьПредставлениеИнформационнойБазы());

		Текст.ЗаписатьСтроку("setlocal");

		Текст.ЗаписатьСтроку("rem -- выгрузка базы данных");
		Текст.ЗаписатьСтроку(
			"%path_1C% CONFIG /F%name_base_backup% /N%user_1C% /P%pswd_1C% /UpdateCfg %cfu_file% /UpdateDBCfg /Out update.log");
		Текст.ЗаписатьСтроку("TIMEOUT /T 60 /NOBREAK ");
		Текст.ЗаписатьСтроку("%path_1C% enterprise /F%name_base_backup% /N%user_1C% /P%pswd_1C%");
		Текст.Закрыть();
		НачатьЗапускПриложения(Новый ОписаниеОповещения("СделатьКопиюЗавершениеЗавершение", ЭтотОбъект), "update.bat",
			Объект.КаталогОбновления);
	Иначе
	КонецЕсли;
#КонецЕсли
КонецПроцедуры

&НаСервере
Процедура СброситьДатуПоследнейКопии()

	Константы.ДатаПоследнейКопии.Установить(Дата(1, 1, 1, 0, 0, 0));
	Константы.ЗапускОбработкиПриОбновлении.Установить(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура СделатьКопиюЗавершениеЗавершение(КодВозврата, ДополнительныеПараметры1) Экспорт
КонецПроцедуры

&НаСервере
Функция ПолучитьУНПНаСервере()
	Возврат Константы.УНП.Получить();

КонецФункции

Функция ПолучитьПредставлениеИнформационнойБазы()

	СтрокаСоединенияСБД =  СтрокаСоединенияИнформационнойБазы();
	ЭтоФайловаяИБ = Найти(Врег(СтрокаСоединенияСБД), "FILE=") = 1;
	Если ЭтоФайловаяИБ Тогда
		ПутьКБД = Сред(СтрокаСоединенияСБД, 6, СтрДлина(СтрокаСоединенияСБД) - 6);
		ФайловаяБД = Истина;
	Иначе
		// надо к имени сервера прибавить имя пути информационной базы
		ПозицияПоиска = Найти(Врег(СтрокаСоединенияСБД), "SRVR=");

		Если ПозицияПоиска <> 1 Тогда
			Возврат Неопределено;
		КонецЕсли;

		ПозицияТочкиСЗапятой = Найти(СтрокаСоединенияСБД, ";");
		НачальнаяПозицияКопирования = 6 + 1;
		КонечнаяПозицияКопирования = ПозицияТочкиСЗапятой - 2;

		ИмяСервера = Сред(СтрокаСоединенияСБД, НачальнаяПозицияКопирования, КонечнаяПозицияКопирования
			- НачальнаяПозицияКопирования + 1);

		СтрокаСоединенияСБД = Сред(СтрокаСоединенияСБД, ПозицияТочкиСЗапятой + 1);
		
		// позиция имени сервера
		ПозицияПоиска = Найти(Врег(СтрокаСоединенияСБД), "REF=");

		Если ПозицияПоиска <> 1 Тогда
			Возврат Неопределено;
		КонецЕсли;

		НачальнаяПозицияКопирования = 6;
		ПозицияТочкиСЗапятой = Найти(СтрокаСоединенияСБД, ";");
		КонечнаяПозицияКопирования = ПозицияТочкиСЗапятой - 2;

		ИмяИБНаСервере = Сред(СтрокаСоединенияСБД, НачальнаяПозицияКопирования, КонечнаяПозицияКопирования
			- НачальнаяПозицияКопирования + 1);

		ПутьКБД = ИмяСервера + "/ " + ИмяИБНаСервере;
		ФайловаяБД = Ложь;
	КонецЕсли;
	Возврат ПутьКБД;
КонецФункции