Процедура ПередЗаписью(Отказ)
	Если Не ЭтоГруппа Тогда
		ПроверкаНаСуществующегоПользователя = ПользователиИнформационнойБазы.НайтиПоИмени(Наименование);
		Если Не ПометкаУдаления Тогда
			Если ПроверкаНаСуществующегоПользователя = Неопределено Тогда
				НовыйПользователь 							  = ПользователиИнформационнойБазы.СоздатьПользователя();
				НовыйПользователь.Имя   					  = Наименование;
				НовыйПользователь.ПолноеИмя					  = Наименование;
				НовыйПользователь.АутентификацияСтандартная   = Истина;
				НовыйПользователь.Пароль					  = Пароль;
				НовыйПользователь.Роли.Добавить(Метаданные.Роли.Найти("Администратор"));
				НовыйПользователь.Записать();
				УИД = НовыйПользователь.УникальныйИдентификатор;
			Иначе
				НовыйПользователь 							  = ПроверкаНаСуществующегоПользователя;
				НовыйПользователь.Имя   					  = Наименование;
				НовыйПользователь.ПолноеИмя					  = Наименование;
				НовыйПользователь.АутентификацияСтандартная   = Истина;
				НовыйПользователь.Пароль					  = Пароль;
				НовыйПользователь.Роли.Добавить(Метаданные.Роли.Найти("Администратор"));
				НовыйПользователь.Записать();
				УИД = НовыйПользователь.УникальныйИдентификатор;
			КонецЕсли;
		Иначе
			Если Не (ПроверкаНаСуществующегоПользователя = Неопределено) Тогда
				ПроверкаНаСуществующегоПользователя = ПользователиИнформационнойБазы.НайтиПоИмени(Наименование);
				ПроверкаНаСуществующегоПользователя.Удалить();
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры