
&НаСервере
Процедура СформироватьНаСервере()    
	ТЧСписокФермы.Очистить();
	
	Макет = Отчеты.СписокФермы.ПолучитьМакет("Макет");
    ОбластьШапка = Макет.ПолучитьОбласть("Шапка"); 
	ОбластьШапка.Параметры.Дата = Отчет.Дата;
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КарточкаСвиноматкиСрезПоследних.НомерЖивотного КАК НомерЖивотного,
		|	КарточкаСвиноматкиСрезПоследних.ДатаРождения КАК ДатаРождения,
		|	КарточкаСвиноматкиСрезПоследних.КодПороды КАК КодПороды,
		|	КарточкаСвиноматкиСрезПоследних.IDНомер КАК IDНомер,
		|	КарточкаСвиноматкиСрезПоследних.НомерЖивотногоОтец КАК НомерЖивотногоОтец,
		|	КарточкаСвиноматкиСрезПоследних.НомерЖивотногоМать КАК НомерЖивотногоМать,
		|	КарточкаСвиноматкиСрезПоследних.НомерОпороса КАК НомерОпороса,
		|	ЖурналОсемененияСрезПоследних.Период КАК ДатаОсеменения,
		|	ЖурналОпоросаСрезПоследних.Период КАК ДатаОпороса,
		|	ЖурналОтъемаСрезПоследних.Период КАК ДатаОтъема,
		|	АбортСрезПоследних.Период КАК ДатаАборта,
		|	КарточкаСвиноматкиСрезПоследних.УшнойВыщип КАК УшнойВыщип
		|ИЗ
		|	РегистрСведений.КарточкаСвиноматки.СрезПоследних(, ) КАК КарточкаСвиноматкиСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЖурналОсеменения.СрезПоследних(, ) КАК ЖурналОсемененияСрезПоследних
		|		ПО КарточкаСвиноматкиСрезПоследних.НомерЖивотного = ЖурналОсемененияСрезПоследних.НомерЖивотного
		|			И КарточкаСвиноматкиСрезПоследних.НомерОпороса = ЖурналОсемененияСрезПоследних.НомерОпороса
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЖурналОпороса.СрезПоследних(, ) КАК ЖурналОпоросаСрезПоследних
		|		ПО КарточкаСвиноматкиСрезПоследних.НомерЖивотного = ЖурналОпоросаСрезПоследних.НомерЖивотного
		|			И КарточкаСвиноматкиСрезПоследних.НомерОпороса = ЖурналОпоросаСрезПоследних.НомерОпороса
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Аборт.СрезПоследних(, ) КАК АбортСрезПоследних
		|		ПО КарточкаСвиноматкиСрезПоследних.НомерЖивотного = АбортСрезПоследних.НомерЖивотного
		|			И КарточкаСвиноматкиСрезПоследних.НомерОпороса = АбортСрезПоследних.НомерОпороса
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЖурналОтъема.СрезПоследних(, ) КАК ЖурналОтъемаСрезПоследних
		|		ПО КарточкаСвиноматкиСрезПоследних.НомерЖивотного = ЖурналОтъемаСрезПоследних.НомерЖивотного
		|			И КарточкаСвиноматкиСрезПоследних.НомерОпороса = ЖурналОтъемаСрезПоследних.НомерОпороса
		|ГДЕ
		|	КарточкаСвиноматкиСрезПоследних.ДатаВыбытие = ДАТАВРЕМЯ(1, 1, 1)
		|
		|СГРУППИРОВАТЬ ПО
		|	КарточкаСвиноматкиСрезПоследних.НомерОпороса,
		|	КарточкаСвиноматкиСрезПоследних.НомерЖивотного,
		|	КарточкаСвиноматкиСрезПоследних.ДатаРождения,
		|	КарточкаСвиноматкиСрезПоследних.КодПороды,
		|	КарточкаСвиноматкиСрезПоследних.IDНомер,
		|	КарточкаСвиноматкиСрезПоследних.НомерЖивотногоОтец,
		|	КарточкаСвиноматкиСрезПоследних.НомерЖивотногоМать,
		|	ЖурналОсемененияСрезПоследних.Период,
		|	ЖурналОпоросаСрезПоследних.Период,
		|	ЖурналОтъемаСрезПоследних.Период,
		|	АбортСрезПоследних.Период,
		|	КарточкаСвиноматкиСрезПоследних.УшнойВыщип";
	
	РезультатЗапроса = Запрос.Выполнить();	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	НомерЖивотного = "";
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
		Если ВыборкаДетальныеЗаписи.НомерЖивотного <> НомерЖивотного И ЗначениеЗаполнено(ОбластьСтрока.Параметры.НомерЖивотного) Тогда
			 НомерЖивотного = ВыборкаДетальныеЗаписи.НомерЖивотного;
			 ЗаполнитьЗначенияСвойств(ТЧСписокФермы.Добавить(),ОбластьСтрока.Параметры);
		КонецЕсли;	
		ОбластьСтрока.Параметры.НомерЖивотного = ВыборкаДетальныеЗаписи.НомерЖивотного; 
		ОбластьСтрока.Параметры.ДатаРождения = ВыборкаДетальныеЗаписи.ДатаРождения;
		ОбластьСтрока.Параметры.КодПороды = ВыборкаДетальныеЗаписи.КодПороды; 
		ОбластьСтрока.Параметры.IDНомер = ВыборкаДетальныеЗаписи.IDНомер;
		ОбластьСтрока.Параметры.НомерЖивотногоОтец = ВыборкаДетальныеЗаписи.НомерЖивотногоОтец; 
		ОбластьСтрока.Параметры.НомерЖивотногоМать = ВыборкаДетальныеЗаписи.НомерЖивотногоМать; 
		ОбластьСтрока.Параметры.НомерОпороса = ВыборкаДетальныеЗаписи.НомерОпороса;
		ОбластьСтрока.Параметры.УшнойВыщип	= ВыборкаДетальныеЗаписи.УшнойВыщип;
		Если ВыборкаДетальныеЗаписи.НомерОпороса > 0 Тогда 
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	РегПоследнееСобытие.ПоследнееСобытие КАК ПоследнееСобытие
				|ИЗ
				|	РегистрСведений.ПоследнееСобытие КАК РегПоследнееСобытие
				|ГДЕ
				|	РегПоследнееСобытие.НомерЖивотного = &НомерЖивотного";	
			Запрос.УстановитьПараметр("НомерЖивотного", ВыборкаДетальныеЗаписи.НомерЖивотного);	
			РезультатЗапроса = Запрос.Выполнить();	
			Выборка = РезультатЗапроса.Выбрать();	
			Пока Выборка.Следующий() Цикл
				Если Выборка.ПоследнееСобытие = Перечисления.ПоследнееСобытие.Случка Тогда
			        ОбластьСтрока.Параметры.Статус = Перечисления.Статус.Супоросные;
				ИначеЕсли Выборка.ПоследнееСобытие = Перечисления.ПоследнееСобытие.Опорос Тогда	 						
					ОбластьСтрока.Параметры.Статус = Перечисления.Статус.Лактирующие;
				ИначеЕсли Выборка.ПоследнееСобытие = Перечисления.ПоследнееСобытие.Отъем Тогда
					ОбластьСтрока.Параметры.Статус = Перечисления.Статус.ПУСТЫЕ;
				КонецЕсли;
			КонецЦикла; 
			Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ДатаОсеменения) Тогда
				ОбластьСтрока.Параметры.ДатаОсеменения = ВыборкаДетальныеЗаписи.ДатаОсеменения; 
			Иначе
				ОбластьСтрока.Параметры.ДатаОсеменения = Дата(1, 1, 1);
			КонецЕсли;	
			Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ДатаАборта) Тогда 
				ОбластьСтрока.Параметры.ДатаАбортаОпороса = ВыборкаДетальныеЗаписи.ДатаАборта;
			ИначеЕсли ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ДатаОпороса) Тогда
				ОбластьСтрока.Параметры.ДатаАбортаОпороса = ВыборкаДетальныеЗаписи.ДатаОпороса; 
			Иначе
				ОбластьСтрока.Параметры.ДатаАбортаОпороса = Дата(1, 1, 1);
			КонецЕсли; 
			Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ДатаОтъема) Тогда
				ОбластьСтрока.Параметры.ДатаОтъема = ВыборкаДетальныеЗаписи.ДатаОтъема; 
			Иначе
				ОбластьСтрока.Параметры.ДатаОтъема = Дата(1, 1, 1);
			КонецЕсли;
			Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.НомерОпороса) Тогда
				Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ДатаОсеменения) И НЕ ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ДатаОпороса) Тогда 
					ОбластьСтрока.Параметры.КоличествоОпоросов = ВыборкаДетальныеЗаписи.НомерОпороса - 1;  
				Иначе
					ОбластьСтрока.Параметры.КоличествоОпоросов = ВыборкаДетальныеЗаписи.НомерОпороса;
				КонецЕсли; 
			КонецЕсли;
		Иначе
			ОбластьСтрока.Параметры.Статус = Перечисления.Статус.ПУСТЫЕ; 
			ОбластьСтрока.Параметры.ДатаОсеменения = Дата(1, 1, 1);
			ОбластьСтрока.Параметры.ДатаАбортаОпороса = Дата(1, 1, 1);
			ОбластьСтрока.Параметры.ДатаОтъема = Дата(1, 1, 1);
			ОбластьСтрока.Параметры.КоличествоОпоросов = 0;
		КонецЕсли;		
   	КонецЦикла;	
	ЗаполнитьЗначенияСвойств(ТЧСписокФермы.Добавить(),ОбластьСтрока.Параметры);
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	СформироватьНаСервере();   
	КоличествоЗаписей = "Кол. опоросов: " + СписокВТЗнаСервере(); 
КонецПроцедуры



&НаСервере
Процедура  ПечатьСпискаФермыНаСервере(ТабДок,МассивИндексов)
	
	Макет =  Отчеты.СписокФермы.ПолучитьМакет("Макет");   
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка"); 
	ОбластьШапка.Параметры.Дата = ?(Отчет.Дата = Дата(1,1,1),Формат(ТекущаяДата(),"ДФ=dd.MM.yyyy"),Отчет.Дата);  
	ТабДок.Вывести(ОбластьШапка);
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	
	Для Каждого Стр ИЗ МассивИндексов Цикл 
			ЗаполнитьЗначенияСвойств(ОбластьСтрока.Параметры, ТЧСписокФермы.Получить(Стр));
			ТабДок.Вывести(ОбластьСтрока); 
	КонецЦикла;

	
КонецПроцедуры 

&НаКлиенте
Процедура ПечатьСпискаФермы(Команда) 
	
	ТабДок = Новый ТабличныйДокумент;  
	
	МассивИндексов = Новый Массив;
	
	Для Каждого Стр ИЗ ТЧСписокФермы Цикл 
		Если Элементы.ТЧСписокФермы.ПроверитьСтроку(Стр.ПолучитьИдентификатор()) Тогда
			МассивИндексов.Добавить(ТЧСписокФермы.Индекс(Стр));
		КонецЕсли;
	КонецЦикла;
	
	ПечатьСпискаФермыНаСервере(ТабДок,МассивИндексов); 
	
	
	ТабДок.ОтображатьСетку 		= Ложь;
	ТабДок.Защита 				= Ложь;
	ТабДок.ТолькоПросмотр 		= Ложь;
	ТабДок.ОтображатьЗаголовки 	= Ложь;
	ТабДок.ОриентацияСтраницы 	= ОриентацияСтраницы.Портрет;
	ТабДок.АвтоМасштаб			= Истина;     
	//ТабДок.Записать(,ТипФайлаТабличногоДокумента.XLSX)
	ТабДок.Напечатать(РежимИспользованияДиалогаПечати.Использовать);
КонецПроцедуры

&НаКлиенте
Процедура ТЧСписокФермыПриАктивизацииСтроки(Элемент)
	КоличествоСтрок = 0;
	Для Каждого Стр ИЗ ТЧСписокФермы Цикл
		Если Элементы.ТЧСписокФермы.ПроверитьСтроку(Стр.ПолучитьИдентификатор()) Тогда
			КоличествоСтрок =  КоличествоСтрок + 1;
		КонецЕсли;
	КонецЦикла;
	КоличествоЗаписей = "Кол. опоросов: " + КоличествоСтрок; 

КонецПроцедуры
&НаСервере
Функция СписокВТЗнаСервере()
	// реквизит1 - динамический список на форме   
		
		КоличествоОпоросов		= ТЧСписокФермы.Количество();    
		Возврат КоличествоОпоросов; 
КонецФункции

&НаКлиенте
Процедура СохранитьВExcel(Команда)
	СтандартнаяОбработка = ЛОжь;
	Режим = РежимДиалогаВыбораФайла.Сохранение; 
	ДиалогОткрытия = Новый ДиалогВыбораФайла(Режим);
	ДиалогОткрытия.Фильтр = "Файлы Microsoft Excel(*.xlsx)|*.xlsx";
	ДиалогОткрытия.Каталог = "";
	ДиалогОткрытия.ПолноеИмяФайла = "СписокФермы";
	ДиалогОткрытия.Расширение	= "*.xlsx";
	ДиалогОткрытия.МножественныйВыбор = Ложь; 
	ДиалогОткрытия.Заголовок = "Выберите каталог"; 
	ДиалогОткрытия.Показать(Новый ОписаниеОповещения("ВыгрузитьЗавершение", ЭтаФорма, Новый Структура("Диалог", ДиалогОткрытия))) 
КонецПроцедуры   

&НаКлиенте
Процедура ВыгрузитьЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	Диалог = ДополнительныеПараметры.Диалог;
	
	//Если (ВыбранныеФайлы <> Неопределено) Тогда
	//	Объект.ПутьСохранения = Диалог.Каталог;     
	//КонецЕсли;
	
	ТабДок = Новый ТабличныйДокумент;  
	
	МассивИндексов = Новый Массив;
	
	Для Каждого Стр ИЗ ТЧСписокФермы Цикл 
		Если Элементы.ТЧСписокФермы.ПроверитьСтроку(Стр.ПолучитьИдентификатор()) Тогда
			МассивИндексов.Добавить(ТЧСписокФермы.Индекс(Стр));
		КонецЕсли;
	КонецЦикла;
	
	ПечатьСпискаФермыНаСервере(ТабДок,МассивИндексов); 
	
	
	ТабДок.ОтображатьСетку 		= Ложь;
	ТабДок.Защита 				= Ложь;
	ТабДок.ТолькоПросмотр 		= Ложь;
	ТабДок.ОтображатьЗаголовки 	= Ложь;
	ТабДок.ОриентацияСтраницы 	= ОриентацияСтраницы.Портрет;
	ТабДок.АвтоМасштаб			= Истина;     
	ТабДок.ЗаписатьАсинх(Диалог.ПолноеИмяФайла,ТипФайлаТабличногоДокумента.XLSX)

КонецПроцедуры

