
&НаСервере
Процедура РезультатУЗИПриИзмененииНаСервере()
	Если Запись.РезультатУЗИ = Перечисления.РезультатУЗИ.Позитивный Тогда 
		НаборЗаписей = РегистрыСведений.ЖурналОпороса.СоздатьНаборЗаписей(); 
        НаборЗаписей.Отбор.НомерЖивотного.Установить(Запись.НомерЖивотного); 
		НаборЗаписей.Отбор.НомерОпороса.Установить(Запись.НомерОпороса);
		НаборЗаписей.Отбор.ДатаВвода.Установить(Запись.ДатаВвода);
        НаборЗаписей.Записать();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РезультатУЗИПриИзменении(Элемент)
	РезультатУЗИПриИзмененииНаСервере();
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("НомерЖивотного") Тогда
		Запись.НомерЖивотного 	= Параметры.НомерЖивотного;
		Запись.НомерОпороса 	= Параметры.НомерОпороса;  
		Запись.ДатаВвода		= Параметры.ДатаВвода;
	КонецЕсли;    
	Если Параметры.Свойство("ФормаОткрыта") Тогда 
		Открытие = Истина; 
	Иначе
		Открытие = Ложь;
	КонецЕсли;
	Запись.Период = НачалоДня(Запись.Период);
КонецПроцедуры


&НаКлиенте
Процедура НомерЖивотногоОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ДанныеПоСвиноматкам = _НастройкиКонфигурацииНаСервере.ПолучитьСписокСвиноматок(ВыбранноеЗначение);
	Если ДанныеПоСвиноматкам.Количество() <> 0 Тогда
		ВыбСтрокаМеню = ВыбратьИзМеню(ДанныеПоСвиноматкам); 
		Если ВыбСтрокаМеню <> Неопределено Тогда 
			Реквизиты = ВыбСтрокаМеню.Значение;
			Запись.НомерЖивотного = Реквизиты.НомерЖивотного;
			Запись.ДатаВвода	  = Реквизиты.ДатаВвода;
		КонецЕсли;
	Иначе
		Предупреждение("Свиноматки с таким номер нет");
	КонецЕсли
КонецПроцедуры


&НаКлиенте
Процедура ДатаУЗИПриИзменении(Элемент)
	Запись.Период = НачалоДня(Запись.Период);
КонецПроцедуры


&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	_ОбработкаОповещенияНаКлиенте.ОткрытьФормуСвиноматки(Запись.НомерЖивотного, Запись.ДатаВвода);
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если Открытие = Истина Тогда 
		Записать(); 
		_ОбработкаОповещенияНаКлиенте.ОткрытьФормуСвиноматки(Запись.НомерЖивотного, Запись.ДатаВвода);
		Закрыть();    
	КонецЕсли;
КонецПроцедуры

