
&НаКлиенте
Процедура ПутьСохраненияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = ЛОжь;
	Режим = РежимДиалогаВыбораФайла.ВыборКаталога; 
	ДиалогОткрытия = Новый ДиалогВыбораФайла(Режим); 
	ДиалогОткрытия.Каталог = ""; 
	ДиалогОткрытия.МножественныйВыбор = Ложь; 
	ДиалогОткрытия.Заголовок = "Выберите каталог"; 
	ДиалогОткрытия.Показать(Новый ОписаниеОповещения("ВыгрузитьЗавершение", ЭтаФорма, Новый Структура("Диалог", ДиалогОткрытия))) 
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	Диалог = ДополнительныеПараметры.Диалог;
	
	Если (ВыбранныеФайлы <> Неопределено) Тогда
		Объект.ПутьСохранения = Диалог.Каталог;     
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СделатьКопию(Команда)   
	ОтвентНавопрос = Неопределено;
   
	ПоказатьВопрос(Новый ОписаниеОповещения("СделатьКопиюЗавершение", ЭтотОбъект), "Работа программы будет завершена. Все не сохраненные данные могут быть утеряны. Делать копию базы данных?",РежимДиалогаВопрос.ДаНет); 

	УстановитьПутьДляВыгрузкиИБНаСервере();

КонецПроцедуры

&НаСервере
Процедура УстановитьПутьДляВыгрузкиИБНаСервере()
	
	Константы.ПутьДляВыгрузкиИБ.Установить(Объект.ПутьСохранения);

КонецПроцедуры

&НаКлиенте
Процедура СделатьКопиюЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		Текст = Новый ЗаписьТекста(
		Объект.ПутьСохранения + "\backup.bat", // имя
		КодировкаТекста.ANSI, // кодировка
		Символы.ПС, // разделитель строк (необ.)
		Ложь // перезаписывать файл, а не дописывать в конец (необ.)
		);
		Текст.ЗаписатьСтроку("echo off");
		Текст.ЗаписатьСтроку("cls"); 
		Текст.ЗаписатьСтроку("chcp 1251");

		
		Текст.ЗаписатьСтроку("rem -- Убивам процесс 1С если он такой есть");
		Текст.ЗаписатьСтроку("taskkill /f /im 1cv8c.exe"); 
		
		Текст.ЗаписатьСтроку("rem -- удаляем файлы старше 14 шт");
		Текст.ЗаписатьСтроку("dir *.dt /a:-D/b/o:-D > del_list_files.txt");
		Текст.ЗаписатьСтроку("for /F ""skip=3"" %%i in (del_list_files.txt) do (del /Q ""%%i"")");
		Текст.ЗаписатьСтроку("del del_list_files.txt");
		Текст.ЗаписатьСтроку("rem ----------------------------------------------- ");
		
		Текст.ЗаписатьСтроку("rem -- определяем какая платформа 1С стоит х86 или х64,");
		Текст.ЗаписатьСтроку("rem -- пути у них разные");
		Текст.ЗаписатьСтроку("IF EXIST ""%programfiles%\1cv8\common\1cestart.exe"" (");
		Текст.ЗаписатьСтроку("	set path_1C=""%programfiles%\1cv8\common\1cestart.exe""");
		Текст.ЗаписатьСтроку("	) ELSE (");
		Текст.ЗаписатьСтроку("	set path_1C=""%programfiles(x86)%\1cv8\common\1cestart.exe""");
		Текст.ЗаписатьСтроку("	)");
		Текст.ЗаписатьСтроку("rem -----------------------------------------------");
		
		Текст.ЗаписатьСтроку("rem -- Данные пользователя");
		Текст.ЗаписатьСтроку("set user_1C=""Пользователь""");
		Текст.ЗаписатьСтроку("set pswd_1C=""""");
		Текст.ЗаписатьСтроку("rem -- Название базы");  
		НазваниеФайла = Строка(_НастройкиКонфигурацииНаСервере.ПолучитьУНПНаСервере())+"_"+Формат(ТекущаяДата(),"ДФ=yyyy-MM-dd")+".dt";
		Текст.ЗаписатьСтроку("set name_base=" + СтрЗаменить(НазваниеФайла," ",""));
		Текст.ЗаписатьСтроку("rem -- путь базы бэкапа");
		Текст.ЗаписатьСтроку("set name_base_backup="+ ПолучитьПредставлениеИнформационнойБазы());
		
		Текст.ЗаписатьСтроку("setlocal");
		
		Текст.ЗаписатьСтроку("rem -- выгрузка базы данных");
		Текст.ЗаписатьСтроку("%path_1C% CONFIG /F%name_base_backup% /N%user_1C% /P%pswd_1C% /DumpIB %name_base%"); 
		Текст.ЗаписатьСтроку("TIMEOUT /T 60 /NOBREAK ");
		Текст.ЗаписатьСтроку("%path_1C% enterprise /F%name_base_backup% /N%user_1C% /P%pswd_1C%");
		Текст.Закрыть();  
		НачатьЗапускПриложения(Новый ОписаниеОповещения("СделатьКопиюЗавершениеЗавершение", ЭтотОбъект),"backup.bat", Объект.ПутьСохранения);  
	Иначе
	КонецЕсли;

КонецПроцедуры



  

Функция ПолучитьПредставлениеИнформационнойБазы()
	
	СтрокаСоединенияСБД =  СтрокаСоединенияИнформационнойБазы();
	ЭтоФайловаяИБ = Найти(Врег(СтрокаСоединенияСБД), "FILE=") = 1;
	Если ЭтоФайловаяИБ Тогда
		ПутьКБД = Сред(СтрокаСоединенияСБД, 6, СтрДлина(СтрокаСоединенияСБД) - 6);
		ФайловаяБД = Истина;
	Иначе
		// надо к имени сервера прибавить имя пути информационной базы
		ПозицияПоиска = Найти(Врег(СтрокаСоединенияСБД), "SRVR=");
		
		Если ПозицияПоиска <> 1 Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		ПозицияТочкиСЗапятой = Найти(СтрокаСоединенияСБД, ";");
		НачальнаяПозицияКопирования = 6 + 1;
		КонечнаяПозицияКопирования = ПозицияТочкиСЗапятой - 2; 
		
		ИмяСервера = Сред(СтрокаСоединенияСБД, НачальнаяПозицияКопирования, КонечнаяПозицияКопирования - НачальнаяПозицияКопирования + 1);
		
		СтрокаСоединенияСБД = Сред(СтрокаСоединенияСБД, ПозицияТочкиСЗапятой + 1);
		
		// позиция имени сервера
		ПозицияПоиска = Найти(Врег(СтрокаСоединенияСБД), "REF=");
		
		Если ПозицияПоиска <> 1 Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		НачальнаяПозицияКопирования = 6;
		ПозицияТочкиСЗапятой = Найти(СтрокаСоединенияСБД, ";");
		КонечнаяПозицияКопирования = ПозицияТочкиСЗапятой - 2; 
		
		ИмяИБНаСервере = Сред(СтрокаСоединенияСБД, НачальнаяПозицияКопирования, КонечнаяПозицияКопирования - НачальнаяПозицияКопирования + 1);
		
		ПутьКБД = ИмяСервера + "/ " + ИмяИБНаСервере;
		ФайловаяБД = Ложь;
	КонецЕсли;
	Возврат ПутьКБД;
КонецФункции    

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Объект.ПутьСохранения = Константы.ПутьДляВыгрузкиИБ.Получить();
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьКопию(Команда)
	ОтвентНавопрос = Неопределено;
   
	ПоказатьВопрос(Новый ОписаниеОповещения("ЗагрузитьКопиюЗавершение", ЭтотОбъект), "Работа программы будет завершена. Все не сохраненные данные могут быть утеряны. Загрузить копию базы данных?",РежимДиалогаВопрос.ДаНет); 

	УстановитьПутьДляВыгрузкиИБНаСервере();
КонецПроцедуры




&НаКлиенте
Процедура ЗагрузитьКопиюЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		Текст = Новый ЗаписьТекста(
		Объект.ПутьЗагрузки + "backup.bat", // имя
		КодировкаТекста.ANSI, // кодировка
		Символы.ПС, // разделитель строк (необ.)
		Ложь // перезаписывать файл, а не дописывать в конец (необ.)
		);
		Текст.ЗаписатьСтроку("echo off");
		Текст.ЗаписатьСтроку("cls");
		Текст.ЗаписатьСтроку("chcp 1251");

		
		Текст.ЗаписатьСтроку("rem -- Убивам процесс 1С если он такой есть");
		Текст.ЗаписатьСтроку("taskkill /f /im 1cv8c.exe"); 
		
		Текст.ЗаписатьСтроку("rem -- удаляем файлы старше 14 шт");
		Текст.ЗаписатьСтроку("dir *.dt /a:-D/b/o:-D > del_list_files.txt");
		Текст.ЗаписатьСтроку("for /F ""skip=3"" %%i in (del_list_files.txt) do (del /Q ""%%i"")");
		Текст.ЗаписатьСтроку("del del_list_files.txt");
		Текст.ЗаписатьСтроку("rem ----------------------------------------------- ");
		
		Текст.ЗаписатьСтроку("rem -- определяем какая платформа 1С стоит х86 или х64,");
		Текст.ЗаписатьСтроку("rem -- пути у них разные");
		Текст.ЗаписатьСтроку("IF EXIST ""%programfiles%\1cv8\common\1cestart.exe"" (");
		Текст.ЗаписатьСтроку("	set path_1C=""%programfiles%\1cv8\common\1cestart.exe""");
		Текст.ЗаписатьСтроку("	) ELSE (");
		Текст.ЗаписатьСтроку("	set path_1C=""%programfiles(x86)%\1cv8\common\1cestart.exe""");
		Текст.ЗаписатьСтроку("	)");
		Текст.ЗаписатьСтроку("rem -----------------------------------------------");
		
		Текст.ЗаписатьСтроку("rem -- Данные пользователя");
		Текст.ЗаписатьСтроку("set user_1C=""Пользователь""");
		Текст.ЗаписатьСтроку("set pswd_1C=""""");
		Текст.ЗаписатьСтроку("rem -- Название базы");  
		НазваниеФайла = Объект.ФайлЗагрузки;
		Текст.ЗаписатьСтроку("set name_base="+НазваниеФайла);
		Текст.ЗаписатьСтроку("rem -- путь базы бэкапа");
		Текст.ЗаписатьСтроку("set name_base_backup="+ ПолучитьПредставлениеИнформационнойБазы());
		
		Текст.ЗаписатьСтроку("setlocal");
		
		Текст.ЗаписатьСтроку("rem -- выгрузка базы данных");
		Текст.ЗаписатьСтроку("%path_1C% CONFIG /F%name_base_backup% /N%user_1C% /P%pswd_1C% /RestoreIB %name_base%"); 
		Текст.ЗаписатьСтроку("TIMEOUT /T 60 /NOBREAK ");
		Текст.ЗаписатьСтроку("%path_1C% enterprise /F%name_base_backup% /N%user_1C% /P%pswd_1C%");
		Текст.Закрыть();  
		НачатьЗапускПриложения(Новый ОписаниеОповещения("СделатьКопиюЗавершениеЗавершение", ЭтотОбъект),"backup.bat", Объект.ПутьЗагрузки);  
	Иначе
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПутьЗагрузкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = ЛОжь;
	Режим = РежимДиалогаВыбораФайла.Открытие; 
	ДиалогОткрытия = Новый ДиалогВыбораФайла(Режим); 
	ДиалогОткрытия.Каталог = "";
	ДиалогОткрытия.Фильтр = "Файл выгрузки (*.dt)|*.dt";
	ДиалогОткрытия.МножественныйВыбор = Ложь; 
	ДиалогОткрытия.Заголовок = "Выберите файл";     
	ДиалогОткрытия.Показать(Новый ОписаниеОповещения("ОткрытьЗавершение", ЭтаФорма, Новый Структура("Диалог", ДиалогОткрытия))) 
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	Диалог = ДополнительныеПараметры.Диалог;
	
	Если (ВыбранныеФайлы <> Неопределено) Тогда
		Объект.ПутьЗагрузки = Диалог.Каталог;   
		Объект.ФайлЗагрузки = СтрЗаменить(Диалог.ПолноеИмяФайла,Диалог.Каталог,"");;

	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура СделатьКопиюЗавершениеЗавершение(КодВозврата, ДополнительныеПараметры1) Экспорт
	
	

КонецПроцедуры
