&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ТекущаяВерсия = _НастройкиКонфигурацииНаСервере.ПолучитьВерсиюКонфигурацииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьОбновление(Команда)
	Если _НастройкиКонфигурацииНаСервере.ФайлаваяБазаНаСервере() Тогда
		ПолучитьФайлыССервера(ВерсияОбновления, Истина);
	КонецЕсли;
КонецПроцедуры
&НаКлиенте
Асинх Процедура ПолучитьФайлыССервера(ВерсияОбновленияВозврат = "", Версия = Ложь)
#Если Не ВебКлиент Тогда
 		//	Сообщение = Новый СообщениеПользователю;
	Попытка
			// Установить соединение с FTP-сервером.    
		Сервер = "by143.atservers.net";
		FTPСервер = Новый FTPСоединение(Сервер, 21, "alftp", "bku-v5y-fF8-zdK", , , , );
	Исключение
			//// Вывести сообщение об ошибке соединения с сервером.
			//Сообщение.Текст = "Не удалось соединиться с сервером: " + Сервер;
			//Сообщение.Сообщить();
			//Сообщение.Текст = ОписаниеОшибки();
			//Сообщение.Сообщить();	

	КонецПопытки;
		// Найти файлы в нужном каталоге по указанной маске.
		//МаскаФайлов = "*.tif";
	МассивФайлов = FTPСервер.НайтиФайлы("/version/*.*");
	Для Каждого Файл Из МассивФайлов Цикл
			// Проверить, что это не каталог.
		Если Файл.ЭтоФайл() Тогда
			ВерсияОбновления =  СтрЗаменить(Файл.ИмяБезРасширения, "_", ".");
			Если Версия Тогда
				ВерсияОбновленияВозврат = ВерсияОбновления;
				Если ВерсияОбновления <> _НастройкиКонфигурацииНаСервере.ПолучитьВерсиюКонфигурацииНаСервере() Тогда
					Элементы.Обновить.Доступность = Истина;
				КонецЕсли;
			Иначе
				Если ВерсияОбновления <> _НастройкиКонфигурацииНаСервере.ПолучитьВерсиюКонфигурацииНаСервере() Тогда
					МассивФайловОбновления = FTPСервер.НайтиФайлы("/update/*.*");
					Для Каждого ФайлОбновления Из МассивФайловОбновления Цикл
						КаталогВременныхФайлов = Ждать КаталогВременныхФайловАсинх();
						ПутьКФайлуОбновления = КаталогВременныхФайлов + ФайлОбновления.Имя;
						FTPСервер.Получить(ФайлОбновления.ПолноеИмя, ПутьКФайлуОбновления);
					КонецЦикла;
					ДопПараментры = Новый Структура("КаталогВременныхФайлов, ПутьКФайлуОбновления",
						КаталогВременныхФайлов, ПутьКФайлуОбновления);
					ОтвентНавопрос = Неопределено;
					ПоказатьВопрос(Новый ОписаниеОповещения("СделатьКопиюЗавершение", _ОбработкаОповещенияНаКлиенте,
						ДопПараментры), "Будет произведено обновление программы", РежимДиалогаВопрос.ОК);

				КонецЕсли;
			КонецЕсли;
				// Копировать файл в локальный каталог.
		КонецЕсли;
	КонецЦикла;

#КонецЕсли

КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	Если _НастройкиКонфигурацииНаСервере.ФайлаваяБазаНаСервере() Тогда
		ПолучитьФайлыССервера();
	КонецЕсли;
КонецПроцедуры