Процедура ПриЗаписи(Отказ, Замещение)
	Для Каждого Запись Из ЭтотОбъект Цикл
		НаборЗаписей = РегистрыСведений.ПоследнееСобытие.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ДатаВвода.Установить(Запись.ДатаВвода);
		НаборЗаписей.Отбор.НомерЖивотного.Установить(Запись.НомерЖивотного);
		НаборЗаписей.Прочитать();
		Если НаборЗаписей.Количество() = 0 Тогда
			ЗаписьСтатус = РегистрыСведений.ПоследнееСобытие.СоздатьМенеджерЗаписи();
			ЗаписьСтатус.ДатаВвода 		= Запись.ДатаВвода;
			ЗаписьСтатус.НомерЖивотного = Запись.НомерЖивотного;
			ЗаписьСтатус.ДатаПоследнегоСобытия =  Запись.Период;
			ЗаписьСтатус.ПоследнееСобытие = Перечисления.ПоследнееСобытие.Опорос;
			ЗаписьСтатус.НомерОпороса     = Запись.НомерОпороса;
			ЗаписьСтатус.Записать(Истина);
		Иначе
			Для Каждого ЗаписьСтатус Из НаборЗаписей Цикл
				Если (Запись.НомерОпороса >= ЗаписьСтатус.НомерОпороса) И (Запись.Период
					> ЗаписьСтатус.ДатаПоследнегоСобытия) Тогда
					ЗаписьСтатус.ДатаВвода 		= Запись.ДатаВвода;
					ЗаписьСтатус.НомерЖивотного = Запись.НомерЖивотного;
					ЗаписьСтатус.ДатаПоследнегоСобытия =  Запись.Период;
					ЗаписьСтатус.ПоследнееСобытие = Перечисления.ПоследнееСобытие.Опорос;
					ЗаписьСтатус.НомерОпороса     = Запись.НомерОпороса;
				КонецЕсли;
			КонецЦикла;
			НаборЗаписей.Записать(Истина);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура ПередЗаписью(Отказ, Замещение)
	Для Каждого Запись Из ЭтотОбъект Цикл
		Если Запись.Живорожденные = 0 И Запись.Мертвые = 0 И Запись.Муммии = 0 И Запись.Свинки = 0
			И Запись.Слаборожденные = 0 Тогда
			Сообщить("Для свиноматки " + Запись.НомерЖивотного + " Не внесены данные по опоросу");
			Если Не Константы.ОтключитьКонтрольОшибок.Получить() Тогда
				ВызватьИсключение ("Для свиноматки " + Запись.НомерЖивотного + " Не внесены данные по опоросу");
				Отказ = Истина;
			КонецЕсли;
		Иначе
			НаборЗаписей = РегистрыСведений.ПоследнееСобытие.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.ДатаВвода.Установить(Запись.ДатаВвода);
			НаборЗаписей.Отбор.НомерЖивотного.Установить(Запись.НомерЖивотного);
			НаборЗаписей.Прочитать();
			Если НаборЗаписей.Количество() = 1 Тогда
				Если НаборЗаписей[0].ПоследнееСобытие = Перечисления.ПоследнееСобытие.Случка
					И НаборЗаписей[0].ДатаПоследнегоСобытия >= Запись.Период И Запись.НомерОпороса = 0 Тогда
					Сообщить("Для свиноматки " + Запись.НомерЖивотного + " Дата опороса должна быть больше " + Формат(
						НаборЗаписей[0].ДатаПоследнегоСобытия, "ДФ=dd.MM.yy"));
					Если Не Константы.ОтключитьКонтрольОшибок.Получить() Тогда
						Отказ = Истина;
						ВызватьИсключение ("Для свиноматки " + Запись.НомерЖивотного
							+ " Дата опороса должна быть больше " + Формат(НаборЗаписей[0].ДатаПоследнегоСобытия,
							"ДФ=dd.MM.yy"));
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры