//&НаСервере
//Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	////Отбор = Новый Структура("НомерЖивотного",Запись.НомерЖивотного);
	//НаборЗаписей = РегистрыСведений.КарточкаСвиноматки.СоздатьНаборЗаписей();
	//НаборЗаписей.Отбор.НомерЖивотного.Установить(Запись.НомерЖивотного);
	//НаборЗаписей.Прочитать();
	//Если НаборЗаписей.Количество() = 0 Тогда
	//	НоваяСтрока = РегистрыСведений.КарточкаСвиноматки.СоздатьМенеджерЗаписи();
	//	НоваяСтрока.Период = ТекущаяДата();
	//	НоваяСтрока.НомерЖивотного = Запись.НомерЖивотного;
	//	НоваяСтрока.ДатаОпороса = Запись.Период;
	//	НоваяСтрока.КодПороды = Запись.КодПороды;
	//	НоваяСтрока.ДатаРождения = Запись.ДатаРождения;
	//	НоваяСтрока.НомерЖивотногоОтец = Запись.НомерЖивотногоОтец;
	//	НоваяСтрока.Живорожденные = Запись.Живорожденные;
	//	НоваяСтрока.Мертвые = Запись.Мертвые;
	//	НоваяСтрока.Слаборожденные = Запись.Слаборожденные;
	//	НоваяСтрока.Муммии = Запись.Муммии;
	//	НоваяСтрока.Свинки = Запись.Свинки;
	//	НоваяСтрока.МассаВсего = Запись.МассаВсего;    
	//	НоваяСтрока.СреднийВес = Запись.СреднийВес;
	//	НоваяСтрока.IDГнезда = Запись.IDГнезда;
	//	НоваяСтрока.Записать();		
	//Иначе	
	//	Для Каждого СтрНаборЗаписей из НаборЗаписей Цикл
	//		СтрНаборЗаписей.НомерЖивотного = Запись.НомерЖивотного;
	//		СтрНаборЗаписей.ДатаОпороса = Запись.Период;
	//		СтрНаборЗаписей.КодПороды = Запись.КодПороды;
	//		СтрНаборЗаписей.ДатаРождения = Запись.ДатаРождения;
	//		СтрНаборЗаписей.НомерЖивотногоОтец = Запись.НомерЖивотногоОтец;
	//		СтрНаборЗаписей.Живорожденные = Запись.Живорожденные;
	//		СтрНаборЗаписей.Мертвые = Запись.Мертвые;
	//		СтрНаборЗаписей.Слаборожденные = Запись.Слаборожденные;
	//		СтрНаборЗаписей.Муммии = Запись.Муммии;
	//		СтрНаборЗаписей.Свинки = Запись.Свинки;
	//		СтрНаборЗаписей.МассаВсего = Запись.МассаВсего;    
	//		СтрНаборЗаписей.СреднийВес = Запись.СреднийВес;
	//		СтрНаборЗаписей.IDГнезда = Запись.IDГнезда;			
	//	КонецЦикла;
	//	НаборЗаписей.Записать();
	//КонецЕсли;

//КонецПроцедуры

&НаСервере
Процедура НомерЖивотногоПриИзмененииНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КарточкаВнесенияДанныхСрезПоследних.ДатаРождения КАК ДатаРождения,
		|	КарточкаВнесенияДанныхСрезПоследних.КодПороды КАК КодПороды,
		|	КарточкаВнесенияДанныхСрезПоследних.НомерГнезда КАК НомерГнезда
		|ИЗ
		|	РегистрСведений.КарточкаВнесенияДанных.СрезПоследних(, ) КАК КарточкаВнесенияДанныхСрезПоследних
		|ГДЕ
		|	КарточкаВнесенияДанныхСрезПоследних.НомерЖивотного = &НомерЖивотного";
	
	Запрос.УстановитьПараметр("НомерЖивотного", Запись.НомерЖивотного);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Запись.ДатаРождения = ВыборкаДетальныеЗаписи.ДатаРождения;
		Запись.КодПороды 	= ВыборкаДетальныеЗаписи.КодПороды;
		Запись.НомерГнезда        = ВыборкаДетальныеЗаписи.НомерГнезда;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура НомерЖивотногоПриИзменении(Элемент)
	НомерЖивотногоПриИзмененииНаСервере();
	Запись.Период = НачалоДня(Запись.Период);
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)    
	Если ТекущийОбъект.Живорожденные = 0 И
		 ТекущийОбъект.Мертвые = 0 И
		 ТекущийОбъект.Муммии = 0 И
		 ТекущийОбъект.Свинки = 0 И
		 ТекущийОбъект.Слаборожденные  = 0 Тогда
		Отказ = Истина; 
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не внесены данные по опоросу";
		Сообщение.Поле = "Живорожденные";
		Сообщение.УстановитьДанные(ТекущийОбъект);
		Сообщение.Сообщить(); 
	КонецЕсли;
		//Отъем
	//Если Запись.Период <= ТекущаяДата() Тогда
	//	НаборЗаписей = РегистрыСведений.ЖурналОтъема.СоздатьНаборЗаписей(); 
	//    НаборЗаписей.Отбор.НомерЖивотного.Установить(Запись.НомерЖивотного); 
	//	НаборЗаписей.Отбор.НомерОпороса.Установить(Запись.НомерОпороса);
	//	НаборЗаписей.Прочитать();
	//
	//	Запрос = Новый Запрос;
	//	Запрос.Текст = 
	//		"ВЫБРАТЬ
	//		|	ЖурналОтъемаСрезПоследних.Период КАК Период
	//		|ИЗ
	//		|	РегистрСведений.ЖурналОтъема.СрезПоследних КАК ЖурналОтъемаСрезПоследних
	//		|ГДЕ
	//		|	ЖурналОтъемаСрезПоследних.НомерЖивотного = &НомерЖивотного
	//		|	И ЖурналОтъемаСрезПоследних.НомерОпороса = &НомерОпороса";
	//	
	//	Запрос.УстановитьПараметр("НомерЖивотного", Запись.НомерЖивотного);
	//	Запрос.УстановитьПараметр("НомерОпороса", Запись.НомерОпороса);	
	//	РезультатЗапроса = Запрос.Выполнить();	
	//	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();	
	//	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
	//		Для Каждого Записи Из НаборЗаписей Цикл
	//			Записи.НомерОпороса = Запись.НомерОпороса;
	//			Записи.НомерЖивотного = Запись.НомерЖивотного;
	//			ПодсосныйПериод = Константы.ПодсосныйПериодСвиноматки.Получить();
	//		    Записи.Период = Запись.Период + ПодсосныйПериод * 60 * 60 * 24;
	//		КонецЦикла;
	//		НаборЗаписей.Записать();
	//	Иначе
	//		НоваяЗапись = НаборЗаписей.Добавить();  
	//		НоваяЗапись.НомерОпороса = Запись.НомерОпороса;
	//		НоваяЗапись.НомерЖивотного = Запись.НомерЖивотного;
	//		ПодсосныйПериод = Константы.ПодсосныйПериодСвиноматки.Получить();
	//		НоваяЗапись.Период = Запись.Период + ПодсосныйПериод * 60 * 60 * 24;
	//		НаборЗаписей.Записать();
	//  	КонецЕсли;
	//КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ПараметрыЗаписи) 
	Если Параметры.Свойство("НомерЖивотного") Тогда
		Запись.НомерЖивотного 	= Параметры.НомерЖивотного;
		Запись.НомерОпороса 	= Параметры.НомерОпороса;  
		Запись.ДатаВвода		= Параметры.ДатаВвода;
		Запись.КодПороды 		= Параметры.Порода;  
		Запись.ДатаРождения		= Параметры.ДатаРождения;
	КонецЕсли;                             
	Если Параметры.Свойство("ФормаОткрыта") Тогда 
		Открытие = Истина; 
	Иначе
		Открытие = Ложь;
	КонецЕсли;
	Запись.Период = НачалоДня(Запись.Период);
КонецПроцедуры

&НаКлиенте
Процедура НомерЖивотногоОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ДанныеПоСвиноматкам = _НастройкиКонфигурацииНаСервере.ПолучитьСписокСвиноматок(ВыбранноеЗначение);
	Если ДанныеПоСвиноматкам.Количество() <> 0 Тогда
		ВыбСтрокаМеню = ВыбратьИзМеню(ДанныеПоСвиноматкам); 
		Если ВыбСтрокаМеню <> Неопределено Тогда 
			Реквизиты = ВыбСтрокаМеню.Значение;
			Запись.НомерЖивотного = Реквизиты.НомерЖивотного;
			Запись.ДатаВвода	  = Реквизиты.ДатаВвода;
			Запись.КодПороды	  = Реквизиты.КодПороды;
		КонецЕсли;
	Иначе
		Предупреждение("Свиноматки с таким номер нет");
	КонецЕсли
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	_ОбработкаОповещенияНаКлиенте.ОткрытьФормуСвиноматки(Запись.НомерЖивотного, Запись.ДатаВвода);
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если Открытие = Истина Тогда 
		Записать(); 
		_ОбработкаОповещенияНаКлиенте.ОткрытьФормуСвиноматки(Запись.НомерЖивотного, Запись.ДатаВвода);
		Закрыть();    
	КонецЕсли;
КонецПроцедуры


