&НаСервере
Процедура КарточкаХрякаНаСервере(ТабДок)
	Макет = РегистрыСведений.КарточкаХряка.ПолучитьМакет("Макет");
	ОбластьШапка 		= Макет.ПолучитьОбласть("Шапка");
	ОбластьШапкаТаблица = Макет.ПолучитьОбласть("ШапкаТаблица");
	ОбластьСтрока		= Макет.ПолучитьОбласть("Строка");
	Для Каждого Стр Из Элементы.Список.ВыделенныеСтроки Цикл
		ЗаполнитьЗначенияСвойств(ОбластьШапка.Параметры, Стр);
		ТабДок.Вывести(ОбластьШапка);
		ТабДок.Вывести(ОбластьШапкаТаблица);
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
					   |	КарточкаХряка.НомерЖивотного КАК НомерЖивотного,
					   |	КарточкаХряка.ДатаРождения КАК ДатаРождения,
					   |	КарточкаХряка.КодПороды КАК КодПороды,
					   |	КарточкаХряка.Период КАК ДатаВвода,
					   |	КарточкаХряка.ДатаВыбытие КАК ДатаВыбытие,
					   |	ГОД(ЖурналОсеменения.Период) КАК СлучнойПериод,
					   |	ЖурналОсеменения.НомерОпороса КАК НомерОпороса,
					   |	ЖурналОсеменения.Период КАК ПокрытоМаток,
					   |	ЖурналОсеменения.НомерЖивотного КАК Свиноматка
					   |ПОМЕСТИТЬ ВТДанные
					   |ИЗ
					   |	РегистрСведений.КарточкаХряка КАК КарточкаХряка
					   |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЖурналОсеменения КАК ЖурналОсеменения
					   |		ПО (КарточкаХряка.НомерЖивотного = ЖурналОсеменения.НомерЖивотногоХряк
					   |				ИЛИ КарточкаХряка.НомерЖивотного = ЖурналОсеменения.НомерЖивотногоХряк1
					   |				ИЛИ КарточкаХряка.НомерЖивотного = ЖурналОсеменения.НомерЖивотногоХряк2)
					   |ГДЕ
					   |	КарточкаХряка.НомерЖивотного = &НомерЖивотного
					   |	И КарточкаХряка.Период = &Период
					   |;
					   |
					   |////////////////////////////////////////////////////////////////////////////////
					   |ВЫБРАТЬ
					   |	ЖурналОсеменения.Период КАК Период,
					   |	ЖурналОсеменения.НомерОпороса КАК НомерОпороса,
					   |	ЖурналОсеменения.НомерЖивотного КАК НомерЖивотного,
					   |	ЖурналОпороса.Период КАК ПериодОпорос,
					   |	ЖурналОпороса.Живорожденные КАК Живорожденные,
					   |	ЖурналОпороса.Мертвые КАК Мертвые,
					   |	ЖурналОпороса.Слаборожденные КАК Слаборожденные,
					   |	ЖурналОпороса.Муммии КАК Муммии,
					   |	ЖурналОтъема.Период КАК ПериодОтъем,
					   |	ЖурналОтъема.КоличествоОтъемышей КАК КоличествоОтъемышей,
					   |	ЖурналОтъема.СреднийВес КАК СреднийВес
					   |ПОМЕСТИТЬ ВТОбщая
					   |ИЗ
					   |	ВТДанные КАК ВТДанные
					   |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЖурналОсеменения КАК ЖурналОсеменения
					   |		ПО ВТДанные.Свиноматка = ЖурналОсеменения.НомерЖивотного
					   |			И ВТДанные.НомерОпороса = ЖурналОсеменения.НомерОпороса
					   |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЖурналОпороса КАК ЖурналОпороса
					   |		ПО ВТДанные.Свиноматка = ЖурналОпороса.НомерЖивотного
					   |			И ВТДанные.НомерОпороса = ЖурналОпороса.НомерОпороса
					   |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЖурналОтъема КАК ЖурналОтъема
					   |		ПО ВТДанные.Свиноматка = ЖурналОтъема.НомерЖивотного
					   |			И ВТДанные.НомерОпороса = ЖурналОтъема.НомерОпороса
					   |;
					   |
					   |////////////////////////////////////////////////////////////////////////////////
					   |ВЫБРАТЬ РАЗЛИЧНЫЕ
					   |	ГОД(ВТОбщая.Период) КАК Период,
					   |	ВТОбщая.Живорожденные КАК Живорожденные,
					   |	ВТОбщая.Мертвые КАК Мертвые,
					   |	ВТОбщая.Слаборожденные КАК Слаборожденные,
					   |	ВТОбщая.Муммии КАК Муммии,
					   |	ВТОбщая.КоличествоОтъемышей КАК КоличествоОтъемышей,
					   |	ВТОбщая.СреднийВес КАК СреднийВес
					   |ПОМЕСТИТЬ ВТДанныеОпорос
					   |ИЗ
					   |	ВТОбщая КАК ВТОбщая
					   |;
					   |
					   |////////////////////////////////////////////////////////////////////////////////
					   |ВЫБРАТЬ
					   |	ВТДанные.СлучнойПериод КАК СлучнойПериод,
					   |	КОЛИЧЕСТВО(ВТДанные.НомерЖивотного) КАК НомерЖивотного
					   |ПОМЕСТИТЬ ВТОпоросов
					   |ИЗ
					   |	ВТДанные КАК ВТДанные
					   |
					   |СГРУППИРОВАТЬ ПО
					   |	ВТДанные.СлучнойПериод
					   |;
					   |
					   |////////////////////////////////////////////////////////////////////////////////
					   |ВЫБРАТЬ
					   |	ГОД(ВТОбщая.Период) КАК СлучнойПериод,
					   |	КОЛИЧЕСТВО(ВТОбщая.НомерЖивотного) КАК НомерЖивотного
					   |ПОМЕСТИТЬ ВТОсеменений
					   |ИЗ
					   |	ВТОбщая КАК ВТОбщая
					   |
					   |СГРУППИРОВАТЬ ПО
					   |	ГОД(ВТОбщая.Период)
					   |;
					   |
					   |////////////////////////////////////////////////////////////////////////////////
					   |ВЫБРАТЬ
					   |	ВТДанныеОпорос.Период КАК Период,
					   |	СУММА(ВТДанныеОпорос.Живорожденные) + СУММА(ВТДанныеОпорос.Мертвые) + СУММА(ВТДанныеОпорос.Слаборожденные) + СУММА(ВТДанныеОпорос.Муммии) КАК Родилось,
					   |	СУММА(ВТДанныеОпорос.Живорожденные) КАК Живые,
					   |	СУММА(ВТДанныеОпорос.КоличествоОтъемышей) КАК КоличествоОтъемышей,
					   |	СУММА(ВТДанныеОпорос.СреднийВес) КАК СреднийВес
					   |ПОМЕСТИТЬ ВТОпоросИтог
					   |ИЗ
					   |	ВТДанныеОпорос КАК ВТДанныеОпорос
					   |
					   |СГРУППИРОВАТЬ ПО
					   |	ВТДанныеОпорос.Период
					   |;
					   |
					   |////////////////////////////////////////////////////////////////////////////////
					   |ВЫБРАТЬ
					   |	ВТОсеменений.СлучнойПериод КАК СлучнойПериод,
					   |	ВТОсеменений.НомерЖивотного КАК ПокрытоМаток,
					   |	ВТОпоросов.НомерЖивотного КАК Опоросилось,
					   |	ВТОсеменений.НомерЖивотного - ВТОпоросов.НомерЖивотного КАК Повторок,
					   |	ОКР(ВТОпоросИтог.Родилось / ВТОсеменений.НомерЖивотного, 2) КАК Родилось,
					   |	ОКР(ВТОпоросИтог.Живые / ВТОсеменений.НомерЖивотного, 2) КАК Живые,
					   |	ОКР(ВТОпоросИтог.КоличествоОтъемышей / ВТОсеменений.НомерЖивотного, 2) КАК КоличествоОтъемышей,
					   |	ВТОпоросИтог.СреднийВес КАК МассаГнезда
					   |ИЗ
					   |	ВТОсеменений КАК ВТОсеменений
					   |		ЛЕВОЕ СОЕДИНЕНИЕ ВТОпоросИтог КАК ВТОпоросИтог
					   |		ПО ВТОсеменений.СлучнойПериод = ВТОпоросИтог.Период
					   |		ЛЕВОЕ СОЕДИНЕНИЕ ВТОпоросов КАК ВТОпоросов
					   |		ПО ВТОсеменений.СлучнойПериод = ВТОпоросов.СлучнойПериод";
		Запрос.УстановитьПараметр("НомерЖивотного", Стр.НомерЖивотного);
		Запрос.УстановитьПараметр("Период", Стр.Период);
		РезультатЗапроса = Запрос.Выполнить().Выбрать();
		Пока РезультатЗапроса.Следующий() Цикл
			ЗаполнитьЗначенияСвойств(ОбластьСтрока.Параметры, РезультатЗапроса);
			ТабДок.Вывести(ОбластьСтрока);
		КонецЦикла;
		ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура КарточкаХряка(Команда)
	ТабДок = Новый ТабличныйДокумент;
	КарточкаХрякаНаСервере(ТабДок);
	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ТолькоПросмотр = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.АвтоМасштаб = Истина;
	ТабДок.Показать();
КонецПроцедуры