
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Запрос = Новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ
	                |	НастройкаКарточкиГруппы.Код КАК Код,
	                |	НастройкаКарточкиГруппы.Название КАК Название,
	                |	НастройкаКарточкиГруппы.ТипСобытия КАК ТипСобытия,
	                |	НастройкаКарточкиГруппы.Дни КАК Дни,
	                |	НастройкаКарточкиГруппы.ПоказатьВКарте КАК ПоказатьВКарте
	                |ИЗ
	                |	РегистрСведений.НастройкаКарточкиГруппы КАК НастройкаКарточкиГруппы";
	ТЧДанные.Загрузить(Запрос.Выполнить().Выгрузить());
КонецПроцедуры

&НаСервере
Процедура ПередЗакрытиемНаСервере()  
	НаборЗаписей = РегистрыСведений.НастройкаКарточкиГруппы.СоздатьНаборЗаписей();
	НаборЗаписей.Записать();
	Для Каждого Стр ИЗ ТЧДанные Цикл
		НоваяЗапись = РегистрыСведений.НастройкаКарточкиГруппы.СоздатьМенеджерЗаписи();	
		ЗаполнитьЗначенияСвойств(НоваяЗапись,Стр);
		НоваяЗапись.Записать();
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	ПередЗакрытиемНаСервере();
КонецПроцедуры
